<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;&nbsp;12&nbsp;&#31456;&nbsp;Web&#26694;&#26550;</title><link rel="stylesheet" href="../styles/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="Spring - Java/J2EE Application Framework"><link rel="up" href="index.html" title="Spring - Java/J2EE Application Framework"><link rel="previous" href="orm.html" title="&#31532;&nbsp;11&nbsp;&#31456;&nbsp;&#20351;&#29992;ORM&#24037;&#20855;&#36827;&#34892;&#25968;&#25454;&#35775;&#38382; "><link rel="next" href="view.html" title="&#31532;&nbsp;13&nbsp;&#31456;&nbsp;&#38598;&#25104;&#34920;&#29616;&#23618;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;&nbsp;12&nbsp;&#31456;&nbsp;Web&#26694;&#26550;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="orm.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="view.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="chapter" lang="zh_cn"><div class="titlepage"><div><div><h2 class="title"><a name="mvc"></a>&#31532;&nbsp;12&nbsp;&#31456;&nbsp;Web&#26694;&#26550;</h2></div></div><div></div></div><div class="sect1" lang="zh_cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mvc-introduction"></a>12.1.&nbsp;Web&#26694;&#26550;&#20171;&#32461;</h2></div></div><div></div></div><p>Spring&#30340;web&#26694;&#26550;&#26159;&#22260;&#32469;&#20998;&#21457;&#22120;&#65288;DispatcherServlet&#65289;&#35774;&#35745;&#30340;&#65292;DispatcherServlet&#23558;&#35831;&#27714;&#20998;&#21457;&#21040;&#19981;&#21516;&#30340;&#22788;&#29702;&#22120;&#65292;&#26694;&#26550;&#36824;&#21253;&#25324;&#21487;&#37197;&#32622;&#30340;&#22788;&#29702;&#22120;&#26144;&#23556;&#65292;&#35270;&#22270;&#35299;&#26512;&#65292;&#26412;&#22320;&#21270;&#65292;&#20027;&#39064;&#35299;&#26512;&#65292;&#36824;&#25903;&#25345;&#25991;&#20214;&#19978;&#20256;&#12290;&#32570;&#30465;&#30340;&#22788;&#29702;&#22120;&#26159;&#19968;&#20010;&#31616;&#21333;&#30340;&#25511;&#21046;&#22120;&#65288;Controller&#65289;&#25509;&#21475;&#65292;&#36825;&#20010;&#25509;&#21475;&#20165;&#20165;&#23450;&#20041;&#20102;<tt class="literal">ModelAndView handleRequest(request,response)</tt>&#26041;&#27861;&#12290;&#20320;&#21487;&#20197;&#23454;&#29616;&#36825;&#20010;&#25509;&#21475;&#29983;&#25104;&#24212;&#29992;&#30340;&#25511;&#21046;&#22120;&#65292;&#20294;&#26159;&#20351;&#29992;Spring&#25552;&#20379;&#30340;&#19968;&#31995;&#21015;&#25511;&#21046;&#22120;&#23454;&#29616;&#20250;&#26356;&#22909;&#19968;&#20123;&#65292;&#27604;&#22914;<tt class="literal">AbstractController</tt>&#65292;<tt class="literal">AbstractCommandController</tt>&#65292;&#21644;<tt class="literal">SimpleFormController</tt>&#12290;&#24212;&#29992;&#25511;&#21046;&#22120;&#19968;&#33324;&#37117;&#20174;&#23427;&#20204;&#32487;&#25215;&#12290;&#27880;&#24847;&#20320;&#38656;&#35201;&#36873;&#25321;&#27491;&#30830;&#30340;&#22522;&#31867;&#65306;&#22914;&#26524;&#20320;&#27809;&#26377;&#34920;&#21333;&#65292;&#20320;&#23601;&#19981;&#38656;&#35201;&#19968;&#20010;FormController&#12290;&#36825;&#26159;&#21644;Structs&#30340;&#19968;&#20010;&#20027;&#35201;&#21306;&#21035;&#12290;</p><p>&#20320;&#21487;&#20197;&#20351;&#29992;&#20219;&#20309;&#23545;&#35937;&#20316;&#20026;&#21629;&#20196;&#23545;&#35937;&#25110;&#34920;&#21333;&#23545;&#35937;&#65306;&#19981;&#24517;&#23454;&#29616;&#26576;&#20010;&#25509;&#21475;&#25110;&#20174;&#26576;&#20010;&#22522;&#31867;&#32487;&#25215;&#12290;Spring&#30340;&#25968;&#25454;&#32465;&#23450;&#30456;&#24403;&#28789;&#27963;&#65292;&#20363;&#22914;&#65292;&#23427;&#35748;&#20026;&#31867;&#22411;&#19981;&#21305;&#37197;&#36825;&#26679;&#30340;&#38169;&#35823;&#24212;&#35813;&#26159;&#24212;&#29992;&#32423;&#30340;&#39564;&#35777;&#38169;&#35823;&#65292;&#32780;&#19981;&#26159;&#31995;&#32479;&#38169;&#35823;&#12290;&#25152;&#20197;&#20320;&#19981;&#38656;&#35201;&#20026;&#20102;&#22788;&#29702;&#26080;&#25928;&#30340;&#34920;&#21333;&#25552;&#20132;&#65292;&#25110;&#32773;&#27491;&#30830;&#22320;&#36716;&#25442;&#23383;&#31526;&#20018;&#65292;&#22312;&#20320;&#30340;&#34920;&#21333;&#23545;&#35937;&#20013;&#29992;&#23383;&#31526;&#20018;&#31867;&#22411;&#37325;&#22797;&#23450;&#20041;&#20320;&#30340;&#19994;&#21153;&#23545;&#35937;&#23646;&#24615;&#12290;&#20320;&#24212;&#35813;&#30452;&#25509;&#32465;&#23450;&#34920;&#21333;&#21040;&#19994;&#21153;&#23545;&#35937;&#19978;&#12290;&#36825;&#26159;&#21644;Struts&#30340;&#21478;&#19968;&#20010;&#37325;&#35201;&#19981;&#21516;&#65292;Struts&#26159;&#22260;&#32469;&#35937;<tt class="literal">Action</tt>&#21644;<tt class="literal">ActionForm</tt>&#36825;&#26679;&#30340;&#22522;&#31867;&#26500;&#24314;&#30340;&#65292;&#27599;&#19968;&#31181;&#34892;&#20026;&#37117;&#26159;&#23427;&#20204;&#30340;&#23376;&#31867;&#12290;</p><p>&#21644;WebWork&#30456;&#27604;&#65292;Spring&#23558;&#23545;&#35937;&#32454;&#20998;&#25104;&#19981;&#21516;&#30340;&#35282;&#33394;&#65306;&#23427;&#25903;&#25345;&#30340;&#27010;&#24565;&#26377;&#25511;&#21046;&#22120;&#65288;Controller&#65289;&#65292;&#21487;&#36873;&#30340;&#21629;&#20196;&#23545;&#35937;&#65288;Command Object&#65289;&#25110;&#34920;&#21333;&#23545;&#35937;&#65288;Form Object&#65289;&#65292;&#20197;&#21450;&#20256;&#36882;&#21040;&#35270;&#22270;&#30340;&#27169;&#22411;&#65288;Model&#65289;&#12290;&#27169;&#22411;&#19981;&#20165;&#21253;&#21547;&#21629;&#20196;&#23545;&#35937;&#25110;&#34920;&#21333;&#23545;&#35937;&#65292;&#32780;&#19988;&#20063;&#21253;&#21547;&#20219;&#20309;&#24341;&#29992;&#25968;&#25454;&#12290;&#20294;&#26159;&#65292;WebWork&#30340;Action&#23558;&#25152;&#26377;&#30340;&#36825;&#20123;&#35282;&#33394;&#37117;&#21512;&#24182;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#23545;&#35937;&#37324;&#12290;WebWork&#20801;&#35768;&#20320;&#22312;&#34920;&#21333;&#20013;&#20351;&#29992;&#29616;&#26377;&#30340;&#19994;&#21153;&#23545;&#35937;&#65292;&#20294;&#26159;&#21482;&#33021;&#25226;&#23427;&#20204;&#23450;&#20041;&#25104;&#19981;&#21516;Action&#31867;&#30340;bean&#23646;&#24615;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#22312;&#36816;&#31639;&#21644;&#34920;&#21333;&#36171;&#20540;&#26102;&#65292;&#20351;&#29992;&#30340;&#26159;&#21516;&#19968;&#20010;&#22788;&#29702;&#35831;&#27714;&#30340;Action&#23454;&#20363;&#12290;&#22240;&#27492;&#65292;&#24341;&#29992;&#25968;&#25454;&#20063;&#38656;&#35201;&#34987;&#23450;&#20041;&#25104;Action&#30340;bean&#23646;&#24615;&#12290;&#36825;&#26679;&#22312;&#19968;&#20010;&#23545;&#35937;&#23601;&#25215;&#25285;&#20102;&#22826;&#22810;&#30340;&#35282;&#33394;&#12290;</p><p>&#23545;&#20110;&#35270;&#22270;&#65306;Spring&#30340;&#35270;&#22270;&#35299;&#26512;&#30456;&#24403;&#28789;&#27963;&#12290;&#19968;&#20010;&#25511;&#21046;&#22120;&#23454;&#29616;&#29978;&#33267;&#21487;&#20197;&#30452;&#25509;&#36755;&#20986;&#19968;&#20010;&#35270;&#22270;&#20316;&#20026;&#21709;&#24212;&#65292;&#36825;&#38656;&#35201;&#20351;&#29992;null&#36820;&#22238;ModelAndView&#12290;&#22312;&#19968;&#33324;&#30340;&#24773;&#20917;&#19979;&#65292;&#19968;&#20010;ModelAndView&#23454;&#20363;&#21253;&#21547;&#35270;&#22270;&#21517;&#23383;&#21644;&#27169;&#22411;&#26144;&#23556;&#34920;&#65292;&#27169;&#22411;&#26144;&#23556;&#34920;&#25552;&#20379;&#20102;bean&#30340;&#21517;&#23383;&#21450;&#20854;&#23545;&#35937;&#65288;&#27604;&#22914;&#21629;&#20196;&#23545;&#35937;&#25110;&#34920;&#21333;&#23545;&#35937;&#65292;&#24341;&#29992;&#25968;&#25454;&#31561;&#31561;&#65289;&#30340;&#23545;&#24212;&#20851;&#31995;&#12290;&#35270;&#22270;&#21517;&#35299;&#26512;&#30340;&#37197;&#32622;&#26159;&#38750;&#24120;&#28789;&#27963;&#30340;&#65292;&#21487;&#20197;&#36890;&#36807;bean&#30340;&#21517;&#23383;&#65292;&#23646;&#24615;&#25991;&#20214;&#25110;&#32773;&#20320;&#33258;&#24049;&#30340;ViewResolver&#26469;&#23454;&#29616;&#12290;&#25277;&#35937;&#30340;&#27169;&#22411;&#26144;&#23556;&#34920;&#23436;&#20840;&#25277;&#35937;&#20102;&#34920;&#29616;&#23618;&#65292;&#27809;&#26377;&#20219;&#20309;&#38480;&#21046;&#65306;JSP&#65292;Velocity&#65292;&#25110;&#32773;&#20854;&#23427;&#30340;&#25216;&#26415;&#8212;&#8212;&#20219;&#20309;&#34920;&#29616;&#23618;&#37117;&#21487;&#20197;&#30452;&#25509;&#21644;Spring&#38598;&#25104;&#12290;&#27169;&#22411;&#26144;&#23556;&#34920;&#20165;&#20165;&#23558;&#25968;&#25454;&#36716;&#25442;&#25104;&#21512;&#36866;&#30340;&#26684;&#24335;&#65292;&#27604;&#22914;JSP&#35831;&#27714;&#23646;&#24615;&#25110;&#32773;Velocity&#27169;&#29256;&#27169;&#22411;&#12290;</p><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-introduction-pluggability"></a>12.1.1.&nbsp;MVC&#23454;&#29616;&#30340;&#21487;&#25193;&#23637;&#24615;</h3></div></div><div></div></div><p>&#35768;&#22810;&#22242;&#38431;&#21162;&#21147;&#20105;&#21462;&#22312;&#25216;&#26415;&#21644;&#24037;&#20855;&#26041;&#38754;&#33021;&#20351;&#20182;&#20204;&#30340;&#25237;&#20837;&#26356;&#26377;&#20215;&#20540;&#65292;&#26080;&#35770;&#26159;&#29616;&#26377;&#30340;&#39033;&#30446;&#36824;&#26159;&#26032;&#30340;&#39033;&#30446;&#37117;&#26159;&#36825;&#26679;&#12290;&#20855;&#20307;&#22320;&#35828;&#65292;Struts &#19981;&#20165;&#26377;&#22823;&#37327;&#30340;&#20070;&#31821;&#21644;&#24037;&#20855;&#65292;&#32780;&#19988;&#26377;&#35768;&#22810;&#24320;&#21457;&#32773;&#29087;&#24713;&#23427;&#12290;&#22240;&#27492;&#65292;&#22914;&#26524;&#20320;&#33021;&#24525;&#21463;Struts&#30340;&#26550;&#26500;&#24615;&#32570;&#38519;&#65292;&#23427;&#20173;&#28982;&#26159;web&#23618;&#19968;&#20010;&#24456;&#22909;&#30340;&#36873;&#25321;&#12290;WebWork&#21644;&#20854;&#23427;web&#26694;&#26550;&#20063;&#26159;&#36825;&#26679;&#12290;</p><p>&#22914;&#26524;&#20320;&#19981;&#24819;&#20351;&#29992;Spring&#30340;web MVC&#26694;&#26550;&#65292;&#32780;&#20165;&#20165;&#24819;&#20351;&#29992;Spring&#25552;&#20379;&#30340;&#20854;&#23427;&#21151;&#33021;&#65292;&#20320;&#21487;&#20197;&#24456;&#23481;&#26131;&#22320;&#23558;&#20320;&#36873;&#25321;&#30340;web&#26694;&#26550;&#21644;Spring&#32467;&#21512;&#36215;&#26469;&#12290;&#21482;&#35201;&#36890;&#36807;Spring&#30340;ContextLoadListener&#21551;&#21160;&#19968;&#20010;Spring&#30340;&#26681;&#24212;&#29992;&#19978;&#19979;&#25991;&#65292;&#24182;&#19988;&#36890;&#36807;&#23427;&#30340;ServletContext&#23646;&#24615;&#65288;&#25110;&#32773;Spring&#30340;&#21508;&#31181;&#24110;&#21161;&#26041;&#27861;&#65289;&#22312;Struts&#25110;WebWork&#30340;Action&#20013;&#35775;&#38382;&#12290;&#27880;&#24847;&#21040;&#29616;&#22312;&#27809;&#26377;&#25552;&#21040;&#20219;&#20309;&#20855;&#20307;&#30340;&#8220;plugins&#8221;&#65292;&#22240;&#27492;&#36825;&#37324;&#20063;&#27809;&#26377;&#25552;&#21450;&#22914;&#20309;&#38598;&#25104;&#65306;&#20174;web&#23618;&#30340;&#35282;&#24230;&#30475;&#65292;&#20320;&#21487;&#20197;&#20165;&#20165;&#25226;Spring&#20316;&#20026;&#19968;&#20010;&#24211;&#20351;&#29992;&#65292;&#26681;&#24212;&#29992;&#19978;&#19979;&#25991;&#23454;&#20363;&#20316;&#20026;&#20837;&#21475;&#12290;</p><p>&#25152;&#26377;&#20320;&#27880;&#20876;&#30340;bean&#21644;Spring&#30340;&#26381;&#21153;&#21487;&#20197;&#22312;&#27809;&#26377;Spring&#30340;web MVC&#19979;&#34987;&#35775;&#38382;&#12290;Spring&#24182;&#27809;&#26377;&#22312;&#20351;&#29992;&#26041;&#27861;&#19978;&#21644;Struts&#25110;WebWork&#31454;&#20105;&#65292;&#23427;&#21482;&#26159;&#25552;&#20379;&#21333;&#19968;web&#26694;&#26550;&#25152;&#27809;&#26377;&#30340;&#21151;&#33021;&#65292;&#20174;bean&#30340;&#37197;&#32622;&#21040;&#25968;&#25454;&#35775;&#38382;&#21644;&#20107;&#21153;&#22788;&#29702;&#12290;&#25152;&#20197;&#20320;&#21487;&#20197;&#20351;&#29992;Spring&#30340;&#20013;&#38388;&#23618;&#21644;&#65288;&#25110;&#32773;&#65289;&#25968;&#25454;&#35775;&#38382;&#23618;&#26469;&#22686;&#24378;&#20320;&#30340;&#24212;&#29992;&#65292;&#21363;&#20351;&#20320;&#21482;&#26159;&#20351;&#29992;&#35937;JDBC&#25110;Hibernate&#20107;&#21153;&#25277;&#35937;&#36825;&#26679;&#30340;&#21151;&#33021;&#12290;</p></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-features"></a>12.1.2.&nbsp;Spring MVC&#26694;&#26550;&#30340;&#29305;&#28857;</h3></div></div><div></div></div><p>&#22914;&#26524;&#20165;&#20165;&#20851;&#27880;&#20110;web&#26041;&#38754;&#30340;&#25903;&#25345;&#65292;Spring&#26377;&#19979;&#38754;&#19968;&#20123;&#29305;&#28857;&#65306;</p><div class="itemizedlist"><ul type="disc" compact><li><p>&#28165;&#26224;&#30340;&#35282;&#33394;&#21010;&#20998;&#65306;&#25511;&#21046;&#22120;&#65292;&#39564;&#35777;&#22120;&#65292;&#21629;&#20196;&#23545;&#35937;&#65292;&#34920;&#21333;&#23545;&#35937;&#21644;&#27169;&#22411;&#23545;&#35937;&#65307;&#20998;&#21457;&#22120;&#65292;&#22788;&#29702;&#22120;&#26144;&#23556;&#21644;&#35270;&#22270;&#35299;&#26512;&#22120;&#65307;&#31561;&#31561;&#12290;</p></li><li><p>&#30452;&#25509;&#23558;&#26694;&#26550;&#31867;&#21644;&#24212;&#29992;&#31867;&#37117;&#20316;&#20026;JavaBean&#37197;&#32622;&#65292;&#21253;&#25324;&#36890;&#36807;&#24212;&#29992;&#19978;&#19979;&#25991;&#37197;&#32622;&#20013;&#38388;&#23618;&#24341;&#29992;&#65292;&#20363;&#22914;&#65292;&#20174;web&#25511;&#21046;&#22120;&#21040;&#19994;&#21153;&#23545;&#35937;&#21644;&#39564;&#35777;&#22120;&#30340;&#24341;&#29992;&#12290;</p></li><li><p>&#21487;&#36866;&#24212;&#24615;&#65292;&#20294;&#19981;&#20855;&#26377;&#24378;&#21046;&#24615;&#65306;&#26681;&#25454;&#19981;&#21516;&#30340;&#24773;&#20917;&#65292;&#20351;&#29992;&#20219;&#20309;&#20320;&#38656;&#35201;&#30340;&#25511;&#21046;&#22120;&#23376;&#31867;&#65288;&#26222;&#36890;&#25511;&#21046;&#22120;&#65292;&#21629;&#20196;&#65292;&#34920;&#21333;&#65292;&#21521;&#23548;&#65292;&#22810;&#20010;&#34892;&#20026;&#65292;&#25110;&#32773;&#33258;&#23450;&#20041;&#30340;&#65289;&#65292;&#32780;&#19981;&#26159;&#35201;&#27714;&#20219;&#20309;&#19996;&#35199;&#37117;&#35201;&#20174;Action/ActionForm&#32487;&#25215;&#12290;</p></li><li><p>&#21487;&#37325;&#29992;&#30340;&#19994;&#21153;&#20195;&#30721;&#65292;&#32780;&#19981;&#38656;&#35201;&#20195;&#30721;&#37325;&#22797;&#65306;&#20320;&#21487;&#20197;&#20351;&#29992;&#29616;&#26377;&#30340;&#19994;&#21153;&#23545;&#35937;&#20316;&#20026;&#21629;&#20196;&#23545;&#35937;&#25110;&#34920;&#21333;&#23545;&#35937;&#65292;&#32780;&#19981;&#38656;&#35201;&#22312;ActionForm&#30340;&#23376;&#31867;&#20013;&#37325;&#22797;&#23427;&#20204;&#30340;&#23450;&#20041;&#12290;</p></li><li><p>&#21487;&#23450;&#21046;&#30340;&#32465;&#23450;&#21644;&#39564;&#35777;&#65306;&#23558;&#31867;&#22411;&#19981;&#21305;&#37197;&#20316;&#20026;&#24212;&#29992;&#32423;&#30340;&#39564;&#35777;&#38169;&#35823;&#65292;&#36825;&#21487;&#20197;&#20445;&#23384;&#38169;&#35823;&#30340;&#20540;&#65292;&#20197;&#21450;&#26412;&#22320;&#21270;&#30340;&#26085;&#26399;&#21644;&#25968;&#23383;&#32465;&#23450;&#31561;&#65292;&#32780;&#19981;&#26159;&#21482;&#33021;&#20351;&#29992;&#23383;&#31526;&#20018;&#34920;&#21333;&#23545;&#35937;&#65292;&#25163;&#21160;&#35299;&#26512;&#23427;&#24182;&#36716;&#25442;&#21040;&#19994;&#21153;&#23545;&#35937;&#12290;</p></li><li><p>&#21487;&#23450;&#21046;&#30340;&#22788;&#29702;&#22120;&#26144;&#23556;&#65292;&#21487;&#23450;&#21046;&#30340;&#35270;&#22270;&#35299;&#26512;&#65306;&#28789;&#27963;&#30340;&#27169;&#22411;&#21487;&#20197;&#26681;&#25454;&#21517;&#23383;/&#20540;&#26144;&#23556;&#65292;&#22788;&#29702;&#22120;&#26144;&#23556;&#21644;&#35270;&#22270;&#35299;&#26512;&#20351;&#24212;&#29992;&#31574;&#30053;&#20174;&#31616;&#21333;&#36807;&#28193;&#21040;&#22797;&#26434;&#65292;&#32780;&#19981;&#26159;&#21482;&#26377;&#19968;&#31181;&#21333;&#19968;&#30340;&#26041;&#27861;&#12290;</p></li><li><p>&#21487;&#23450;&#21046;&#30340;&#26412;&#22320;&#21270;&#21644;&#20027;&#39064;&#35299;&#26512;&#65292;&#25903;&#25345;JSP&#65292;&#26080;&#35770;&#26377;&#27809;&#26377;&#20351;&#29992;Spring&#26631;&#31614;&#24211;&#65292;&#25903;&#25345;JSTL&#65292;&#25903;&#25345;&#19981;&#38656;&#35201;&#39069;&#22806;&#36807;&#28193;&#30340;Velocity&#65292;&#31561;&#31561;&#12290;</p></li><li><p>&#31616;&#21333;&#32780;&#24378;&#22823;&#30340;&#26631;&#31614;&#24211;&#65292;&#23427;&#23613;&#21487;&#33021;&#22320;&#36991;&#20813;&#22312;HTML&#29983;&#25104;&#26102;&#30340;&#24320;&#38144;&#65292;&#25552;&#20379;&#22312;&#26631;&#35760;&#26041;&#38754;&#30340;&#26368;&#22823;&#28789;&#27963;&#24615;&#12290;</p></li></ul></div></div></div><div class="sect1" lang="zh_cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mvc-servlet"></a>12.2.&nbsp;&#20998;&#21457;&#22120;&#65288;<tt class="literal">DispatcherServlet</tt>&#65289;</h2></div></div><div></div></div><p>Spring&#30340;web&#26694;&#26550;&#8212;&#8212;&#35937;&#20854;&#23427;web&#26694;&#26550;&#19968;&#26679;&#8212;&#8212;&#26159;&#19968;&#20010;&#35831;&#27714;&#39537;&#21160;&#30340;web&#26694;&#26550;&#65292;&#20854;&#35774;&#35745;&#22260;&#32469;&#19968;&#20010;&#33021;&#23558;&#35831;&#27714;&#20998;&#21457;&#21040;&#25511;&#21046;&#22120;&#30340;servlet&#65292;&#23427;&#20063;&#25552;&#20379;&#20854;&#23427;&#21151;&#33021;&#24110;&#21161;web&#24212;&#29992;&#24320;&#21457;&#12290;&#28982;&#32780;&#65292;Spring&#30340;<tt class="literal">DispatcherServlet</tt>&#25152;&#20570;&#30340;&#19981;&#20165;&#20165;&#26159;&#36825;&#20123;&#12290;&#23427;&#21644;Spring&#30340;ApplicationContext&#23436;&#20840;&#38598;&#25104;&#22312;&#19968;&#36215;&#65292;&#20801;&#35768;&#20320;&#20351;&#29992;Spring&#30340;&#20854;&#23427;&#21151;&#33021;&#12290;</p><p>DispatcherServlet&#21644;&#20854;&#23427;servlet&#19968;&#26679;&#23450;&#20041;&#22312;&#20320;&#30340;web&#24212;&#29992;&#30340;<tt class="literal">web.xml</tt>&#25991;&#20214;&#37324;&#12290;DispatcherServlet&#22788;&#29702;&#30340;&#35831;&#27714;&#24517;&#39035;&#22312;&#21516;&#19968;&#20010;<tt class="literal">web.xml</tt>&#25991;&#20214;&#37324;&#20351;&#29992;url-mapping&#23450;&#20041;&#26144;&#23556;&#12290;</p><pre class="programlisting">&lt;web-app&gt;
    ...
    &lt;servlet&gt;
        &lt;servlet-name&gt;example&lt;/servlet-name&gt;
        &lt;servlet-class&gt;org.springframework.web.servlet.DispatcherServlet&lt;/servlet-class&gt;
        &lt;load-on-startup&gt;1&lt;/load-on-startup&gt;
    &lt;/servlet&gt;
    &lt;servlet-mapping&gt;
        &lt;servlet-name&gt;example&lt;/servlet-name&gt;
        &lt;url-pattern&gt;*.form&lt;/url-pattern&gt;
    &lt;/servlet-mapping&gt;    
&lt;/web-app&gt;</pre><p>&#22312;&#19978;&#38754;&#30340;&#20363;&#23376;&#37324;&#65292;&#25152;&#26377;&#20197;<tt class="literal">.form</tt>&#32467;&#23614;&#30340;&#35831;&#27714;&#37117;&#20250;&#30001;DispatcherServlet&#22788;&#29702;&#12290;&#25509;&#19979;&#26469;&#38656;&#35201;&#37197;&#32622;DispatcherServlet&#26412;&#36523;&#12290;&#27491;&#22914;&#22312;<a href="beans.html#context-introduction" title="3.10.&nbsp;&#20171;&#32461;ApplicationContext">&#31532;&nbsp;3.10&nbsp;&#33410; &#8220;&#20171;&#32461;ApplicationContext&#8221;</a>&#20013;&#25152;&#25551;&#36848;&#30340;&#65292;Spring&#20013;&#30340;ApplicationContexts&#21487;&#20197;&#34987;&#38480;&#21046;&#22312;&#19981;&#21516;&#30340;&#20316;&#29992;&#22495;&#12290;&#22312;web&#26694;&#26550;&#20013;&#65292;&#27599;&#20010;DispatcherServlet&#26377;&#23427;&#33258;&#24049;&#30340;<tt class="literal">WebApplicationContext</tt>&#65292;&#23427;&#21253;&#21547;&#20102;DispatcherServlet&#37197;&#32622;&#25152;&#38656;&#35201;&#30340;bean&#12290;DispatcherServlet &#20351;&#29992;&#30340;&#32570;&#30465;BeanFactory&#26159;<tt class="literal">XmlBeanFactory</tt>&#65292;&#24182;&#19988;DispatcherServlet&#22312;&#21021;&#22987;&#21270;&#26102;&#20250;&#22312;&#20320;&#30340;web&#24212;&#29992;&#30340;<tt class="literal">WEB-INF</tt>&#30446;&#24405;&#19979;<span class="emphasis"><em>&#23547;&#25214;<tt class="literal">[servlet-name]-servlet.xml</tt>&#25991;&#20214;</em></span>&#12290;DispatcherServlet&#20351;&#29992;&#30340;&#32570;&#30465;&#20540;&#21487;&#20197;&#20351;&#29992;servlet&#21021;&#22987;&#21270;&#21442;&#25968;&#20462;&#25913;&#65288;&#35814;&#32454;&#20449;&#24687;&#22914;&#19979;&#65289;&#12290;</p><p><tt class="literal">WebApplicationContext</tt>&#20165;&#20165;&#26159;&#19968;&#20010;&#25317;&#26377;web&#24212;&#29992;&#24517;&#35201;&#21151;&#33021;&#30340;&#26222;&#36890;ApplicationContext&#12290;&#23427;&#21644;&#19968;&#20010;&#26631;&#20934;&#30340;ApplicationContext&#30340;&#19981;&#21516;&#20043;&#22788;&#22312;&#20110;&#23427;&#33021;&#22815;&#35299;&#26512;&#20027;&#39064;&#65288;&#21442;&#32771;<a href="mvc.html#mvc-themeresolver" title="12.7.&nbsp;&#20027;&#39064;&#20351;&#29992;">&#31532;&nbsp;12.7&nbsp;&#33410; &#8220;&#20027;&#39064;&#20351;&#29992;&#8221;</a>&#65289;&#65292;&#24182;&#19988;&#23427;&#30693;&#36947;&#21644;&#37027;&#20010;servlet&#20851;&#32852;&#65288;&#36890;&#36807;&#21040;<tt class="literal">ServletContext</tt>&#30340;&#36830;&#25509;&#65289;&#12290;WebApplicationContext&#34987;&#32465;&#23450;&#22312;ServletContext&#19978;&#65292;&#24403;&#20320;&#38656;&#35201;&#30340;&#26102;&#20505;&#65292;&#21487;&#20197;&#20351;&#29992;<tt class="literal">RequestContextUtils</tt>&#25214;&#21040;WebApplicationContext&#12290;</p><p>Spring&#30340;DispatcherServlet&#26377;&#19968;&#32452;&#29305;&#27530;&#30340;bean&#65292;&#29992;&#26469;&#22788;&#29702;&#35831;&#27714;&#21644;&#26174;&#31034;&#30456;&#24212;&#30340;&#35270;&#22270;&#12290;&#36825;&#20123;bean&#21253;&#21547;&#22312;Spring&#30340;&#26694;&#26550;&#37324;&#65292;&#65288;&#21487;&#36873;&#25321;&#65289;&#21487;&#20197;&#22312;WebApplicationContext&#20013;&#37197;&#32622;&#65292;&#37197;&#32622;&#26041;&#24335;&#23601;&#35937;&#37197;&#32622;&#20854;&#23427;bean&#30340;&#26041;&#24335;&#19968;&#26679;&#12290;&#36825;&#20123;bean&#20013;&#30340;&#27599;&#19968;&#20010;&#37117;&#22312;&#19979;&#38754;&#34987;&#35814;&#32454;&#25551;&#36848;&#12290;&#24453;&#19968;&#20250;&#20799;&#65292;&#25105;&#20204;&#23601;&#20250;&#25552;&#21040;&#23427;&#20204;&#65292;&#20294;&#36825;&#37324;&#20165;&#20165;&#26159;&#35753;&#20320;&#30693;&#36947;&#23427;&#20204;&#30340;&#23384;&#22312;&#20197;&#20415;&#25105;&#20204;&#32487;&#32493;&#35752;&#35770;DispatcherServlet&#12290;&#23545;&#22823;&#22810;&#25968;bean&#65292;&#37117;&#25552;&#20379;&#20102;&#32570;&#30465;&#20540;&#65292;&#25152;&#26377;&#20320;&#19981;&#24517;&#35201;&#25285;&#24515;&#23427;&#20204;&#30340;&#20540;&#12290;</p><div class="table"><a name="d0e6182"></a><p class="title"><b>&#34920;&nbsp;12.1.&nbsp;WebApplicationContext&#20013;&#29305;&#27530;&#30340;bean</b></p><table summary="WebApplicationContext&#20013;&#29305;&#27530;&#30340;bean" border="1"><colgroup><col><col></colgroup><thead><tr><th>&#21517;&#31216;</th><th>&#35299;&#37322;</th></tr></thead><tbody><tr><td>&#22788;&#29702;&#22120;&#26144;&#23556;&#65288;handler mapping(s)&#65289;</td><td>(<a href="mvc.html#mvc-handlermapping" title="12.4.&nbsp;&#22788;&#29702;&#22120;&#26144;&#23556;">&#31532;&nbsp;12.4&nbsp;&#33410; &#8220;&#22788;&#29702;&#22120;&#26144;&#23556;&#8221;</a>)  &#21069;&#22788;&#29702;&#22120;&#65292;&#21518;&#22788;&#29702;&#22120;&#21644;&#25511;&#21046;&#22120;&#30340;&#21015;&#34920;&#65292;&#23427;&#20204;&#22312;&#31526;&#21512;&#26576;&#31181;&#26465;&#20214;&#19979;&#25165;&#34987;&#25191;&#34892;&#65288;&#20363;&#22914;&#31526;&#21512;&#25511;&#21046;&#22120;&#25351;&#23450;&#30340;URL&#65289;</td></tr><tr><td>&#25511;&#21046;&#22120;&#65288;controller(s)&#65289;</td><td>(<a href="mvc.html#mvc-controller" title="12.3.&nbsp;&#25511;&#21046;&#22120;">&#31532;&nbsp;12.3&nbsp;&#33410; &#8220;&#25511;&#21046;&#22120;&#8221;</a>) &#20316;&#20026;MVC&#19977;&#23618;&#19968;&#37096;&#20998;&#65292;&#25552;&#20379;&#20855;&#20307;&#21151;&#33021;&#65288;&#25110;&#32773;&#33267;&#23569;&#33021;&#22815;&#35775;&#38382;&#20855;&#20307;&#21151;&#33021;&#65289;&#30340;bean</td></tr><tr><td>&#35270;&#22270;&#35299;&#26512;&#22120;&#65288;view resolver&#65289;</td><td>(<a href="mvc.html#mvc-viewresolver" title="12.5.&nbsp;&#35270;&#22270;&#19982;&#35270;&#22270;&#35299;&#26512;">&#31532;&nbsp;12.5&nbsp;&#33410; &#8220;&#35270;&#22270;&#19982;&#35270;&#22270;&#35299;&#26512;&#8221;</a>) &#33021;&#22815;&#35299;&#26512;&#35270;&#22270;&#21517;&#65292;&#22312;DispatcherServlet&#35299;&#26512;&#35270;&#22270;&#26102;&#20351;&#29992;</td></tr><tr><td>&#26412;&#22320;&#21270;&#20449;&#24687;&#35299;&#26512;&#22120;&#65288;locale resolver&#65289;</td><td>(<a href="mvc.html#mvc-localeresolver" title="12.6.&nbsp;&#20351;&#29992;&#26412;&#22320;&#21270;&#20449;&#24687;">&#31532;&nbsp;12.6&nbsp;&#33410; &#8220;&#20351;&#29992;&#26412;&#22320;&#21270;&#20449;&#24687;&#8221;</a>) &#33021;&#22815;&#35299;&#26512;&#29992;&#25143;&#27491;&#22312;&#20351;&#29992;&#30340;&#26412;&#22320;&#21270;&#20449;&#24687;&#65292;&#20197;&#25552;&#20379;&#22269;&#38469;&#21270;&#35270;&#22270;</td></tr><tr><td>&#20027;&#39064;&#35299;&#26512;&#22120;&#65288;theme resolver&#65289;</td><td>(<a href="mvc.html#mvc-themeresolver" title="12.7.&nbsp;&#20027;&#39064;&#20351;&#29992;">&#31532;&nbsp;12.7&nbsp;&#33410; &#8220;&#20027;&#39064;&#20351;&#29992;&#8221;</a>) &#33021;&#22815;&#35299;&#26512;&#20320;&#30340;web&#24212;&#29992;&#25152;&#20351;&#29992;&#30340;&#20027;&#39064;,&#27604;&#22914;,&#25552;&#20379;&#20010;&#24615;&#21270;&#30340;&#24067;&#23616;</td></tr><tr><td>multipart&#35299;&#26512;&#22120;</td><td>(<a href="mvc.html#mvc-multipart" title="12.8.&nbsp;Spring&#23545;multipart&#65288;&#25991;&#20214;&#19978;&#20256;&#65289;&#30340;&#25903;&#25345;">&#31532;&nbsp;12.8&nbsp;&#33410; &#8220;Spring&#23545;multipart&#65288;&#25991;&#20214;&#19978;&#20256;&#65289;&#30340;&#25903;&#25345;&#8221;</a>) &#25552;&#20379;HTML&#34920;&#21333;&#25991;&#20214;&#19978;&#20256;&#21151;&#33021;</td></tr><tr><td>&#22788;&#29702;&#22120;&#24322;&#24120;&#35299;&#26512;&#22120;&#65288;handlerexception resolver&#65289;</td><td>(<a href="mvc.html#mvc-exceptionhandlers" title="12.9.&nbsp;&#22788;&#29702;&#24322;&#24120;">&#31532;&nbsp;12.9&nbsp;&#33410; &#8220;&#22788;&#29702;&#24322;&#24120;&#8221;</a>) &#23558;&#24322;&#24120;&#23545;&#24212;&#21040;&#35270;&#22270;,&#25110;&#32773;&#23454;&#29616;&#26576;&#31181;&#22797;&#26434;&#30340;&#24322;&#24120;&#22788;&#29702;&#20195;&#30721;</td></tr></tbody></table></div><p>&#24403;DispatcherServlet&#34987;&#23433;&#35013;&#37197;&#32622;&#22909;&#65292;DispatcherServlet&#19968;&#25509;&#25910;&#21040;&#35831;&#27714;&#65292;&#22788;&#29702;&#23601;&#24320;&#22987;&#20102;&#12290;&#19979;&#38754;&#30340;&#21015;&#34920;&#25551;&#36848;&#20102;DispatcherServlet&#22788;&#29702;&#35831;&#27714;&#30340;&#20840;&#36807;&#31243;&#65306;</p><div class="orderedlist"><ol type="1" compact><li><p>&#25628;&#32034;WebApplicationContext&#65292;&#24182;&#23558;&#23427;&#32465;&#23450;&#21040;&#35831;&#27714;&#30340;&#19968;&#20010;&#23646;&#24615;&#19978;&#65292;&#20197;&#20415;&#25511;&#21046;&#22120;&#21644;&#22788;&#29702;&#38142;&#19978;&#30340;&#20854;&#23427;&#22788;&#29702;&#22120;&#33021;&#20351;&#29992;WebApplicationContext&#12290;&#32570;&#30465;&#23427;&#34987;&#32465;&#23450;&#22312;<tt class="literal">DispatcherServlet.WEB_APPLICATION_CONTEXT_ATTRIBUTE</tt>&#36825;&#20010;&#20851;&#38190;&#23383;&#19978;</p></li><li><p>&#32465;&#23450;&#26412;&#22320;&#21270;&#20449;&#24687;&#35299;&#26512;&#22120;&#21040;&#35831;&#27714;&#19978;&#65292;&#36825;&#26679;&#20351;&#24471;&#22788;&#29702;&#38142;&#19978;&#30340;&#22788;&#29702;&#22120;&#22312;&#22788;&#29702;&#35831;&#27714;&#65288;&#26174;&#31034;&#35270;&#22270;&#65292;&#20934;&#22791;&#25968;&#25454;&#31561;&#31561;&#65289;&#26102;&#33021;&#35299;&#26512;&#26412;&#22320;&#21270;&#20449;&#24687;&#12290;&#22914;&#26524;&#20320;&#19981;&#20351;&#29992;&#26412;&#22320;&#21270;&#20449;&#24687;&#35299;&#26512;&#22120;&#65292;&#23427;&#19981;&#20250;&#24433;&#21709;&#20219;&#20309;&#19996;&#35199;&#65292;&#24573;&#30053;&#23427;&#23601;&#21487;&#20197;&#20102;</p></li><li><p>&#32465;&#23450;&#20027;&#39064;&#35299;&#26512;&#22120;&#21040;&#35831;&#27714;&#19978;&#65292;&#20351;&#24471;&#35270;&#22270;&#20915;&#23450;&#20351;&#29992;&#21738;&#20010;&#20027;&#39064;&#65288;&#22914;&#26524;&#20320;&#19981;&#38656;&#35201;&#20027;&#39064;&#65292;&#21487;&#20197;&#24573;&#30053;&#23427;&#65292;&#35299;&#26512;&#22120;&#20165;&#20165;&#26159;&#32465;&#23450;&#65292;&#22914;&#26524;&#20320;&#19981;&#20351;&#29992;&#23427;&#65292;&#19981;&#20250;&#24433;&#21709;&#20219;&#20309;&#19996;&#35199;&#65289;</p></li><li><p>&#22914;&#26524;multipart&#35299;&#26512;&#22120;&#34987;&#25351;&#23450;&#65292;&#35831;&#27714;&#20250;&#34987;&#26816;&#26597;&#26159;&#21542;&#20351;&#29992;&#20102;multipart&#65292;&#22914;&#26524;&#26159;&#65292;multipart&#35299;&#26512;&#22120;&#20250;&#34987;&#20445;&#23384;&#22312;<tt class="literal">MultipartHttpServletRequest</tt>&#20013;&#20197;&#20415;&#34987;&#22788;&#29702;&#38142;&#20013;&#30340;&#20854;&#23427;&#22788;&#29702;&#22120;&#20351;&#29992;&#65288;&#19979;&#38754;&#20250;&#35762;&#21040;&#26356;&#22810;&#26377;&#20851;multipart&#22788;&#29702;&#30340;&#20869;&#23481;&#65289;</p></li><li><p>&#25628;&#32034;&#21512;&#36866;&#30340;&#22788;&#29702;&#22120;&#12290;&#22914;&#26524;&#25214;&#21040;&#65292;&#25191;&#34892;&#21644;&#36825;&#20010;&#22788;&#29702;&#22120;&#30456;&#20851;&#30340;&#25191;&#34892;&#38142;&#65288;&#39044;&#22788;&#29702;&#22120;&#65292;&#21518;&#22788;&#29702;&#22120;&#65292;&#25511;&#21046;&#22120;&#65289;&#65292;&#20197;&#20415;&#20934;&#22791;&#27169;&#22411;&#25968;&#25454;</p></li><li><p>&#22914;&#26524;&#27169;&#22411;&#25968;&#25454;&#34987;&#36820;&#36824;&#65292;&#23601;&#20351;&#29992;&#37197;&#32622;&#22312;WebApplicationContext&#20013;&#30340;&#35270;&#22270;&#35299;&#26512;&#22120;&#65292;&#26174;&#31034;&#35270;&#22270;&#65292;&#21542;&#21017;&#65288;&#21487;&#33021;&#26159;&#23433;&#20840;&#21407;&#22240;&#65292;&#39044;&#22788;&#29702;&#22120;&#25110;&#21518;&#22788;&#29702;&#22120;&#25130;&#21462;&#20102;&#35831;&#27714;&#65289;&#65292;&#34429;&#28982;&#35831;&#27714;&#33021;&#22815;&#25552;&#20379;&#24517;&#35201;&#30340;&#20449;&#24687;&#65292;&#20294;&#26159;&#35270;&#22270;&#20063;&#19981;&#20250;&#34987;&#26174;&#31034;&#12290;</p></li></ol></div><p>&#22312;&#35831;&#27714;&#22788;&#29702;&#36807;&#31243;&#20013;&#25243;&#20986;&#30340;&#24322;&#24120;&#21487;&#20197;&#34987;&#20219;&#20309;&#23450;&#20041;&#22312;WebApplicationContext&#20013;&#30340;&#24322;&#24120;&#35299;&#26512;&#22120;&#25152;&#33719;&#21462;&#12290;&#20351;&#29992;&#36825;&#20123;&#24322;&#24120;&#35299;&#26512;&#22120;&#65292;&#20320;&#21487;&#20197;&#22312;&#24322;&#24120;&#25243;&#20986;&#26102;&#23450;&#20041;&#29305;&#23450;&#34892;&#20026;&#12290;</p><p>Spring&#30340;DispatcherServlet&#20063;&#25903;&#25345;&#36820;&#22238;Servlet API&#23450;&#20041;&#30340;<span class="emphasis"><em>last-modification-date</em></span>&#65292;&#20915;&#23450;&#26576;&#20010;&#35831;&#27714;&#26368;&#21518;&#20462;&#25913;&#30340;&#26085;&#26399;&#24456;&#31616;&#21333;&#12290;DispatcherServlet&#20250;&#39318;&#20808;&#23547;&#25214;&#19968;&#20010;&#21512;&#36866;&#30340;&#22788;&#29702;&#22120;&#26144;&#23556;&#65292;&#26816;&#26597;&#22788;&#29702;&#22120;&#26159;&#21542;<span class="emphasis"><em>&#23454;&#29616;&#20102;<tt class="literal">LastModified</tt>&#25509;&#21475;</em></span>&#65292;&#22914;&#26524;&#26159;&#65292;&#23558;<tt class="literal">long getLastModified(request)</tt>&#30340;&#20540;&#36820;&#22238;&#32473;&#23458;&#25143;&#31471;&#12290;</p><p>&#20320;&#21487;&#20197;&#22312;<tt class="literal">web.xml</tt>&#25991;&#20214;&#20013;&#28155;&#21152;&#19978;&#19979;&#25991;&#21442;&#25968;&#25110;servlet&#21021;&#22987;&#21270;&#21442;&#25968;&#23450;&#21046;Spring&#30340;DispatcherServlet&#12290;&#19979;&#38754;&#26159;&#19968;&#20123;&#21487;&#33021;&#30340;&#21442;&#25968;&#12290;</p><div class="table"><a name="d0e6292"></a><p class="title"><b>&#34920;&nbsp;12.2.&nbsp;DispatcherServlet&#21021;&#22987;&#21270;&#21442;&#25968;</b></p><table summary="DispatcherServlet&#21021;&#22987;&#21270;&#21442;&#25968;" border="1"><colgroup><col><col></colgroup><thead><tr><th>&#21442;&#25968;</th><th>&#35299;&#37322;</th></tr></thead><tbody><tr><td><tt class="literal">contextClass</tt></td><td>&#23454;&#29616;<tt class="literal">WebApplicationContext</tt>&#30340;&#31867;&#65292;&#24403;&#21069;&#30340;servlet&#29992;&#23427;&#26469;&#23454;&#20363;&#21270;&#19978;&#19979;&#25991;&#12290;&#22914;&#26524;&#36825;&#20010;&#21442;&#25968;&#27809;&#26377;&#25351;&#23450;&#65292;&#20351;&#29992;<tt class="literal">XmlWebApplicationContext</tt></td></tr><tr><td><tt class="literal">contextConfigLocation</tt></td><td>&#20256;&#32473;&#19978;&#19979;&#25991;&#23454;&#20363;&#65288;&#30001;<tt class="literal">contextClass</tt>&#25351;&#23450;&#65289;&#30340;&#23383;&#31526;&#20018;&#65292;&#29992;&#26469;&#25351;&#23450;&#19978;&#19979;&#25991;&#30340;&#20301;&#32622;&#12290;&#36825;&#20010;&#23383;&#31526;&#20018;&#21487;&#20197;&#34987;&#20998;&#25104;&#22810;&#20010;&#23383;&#31526;&#20018;&#65288;&#20351;&#29992;&#36887;&#21495;&#20316;&#20026;&#20998;&#38548;&#31526;&#65289;&#26469;&#25903;&#25345;&#22810;&#20010;&#19978;&#19979;&#25991;&#65288;&#22312;&#22810;&#19978;&#19979;&#25991;&#30340;&#24773;&#20917;&#19979;&#65292;&#34987;&#23450;&#20041;&#20004;&#27425;&#30340;bean&#20013;&#65292;&#21518;&#38754;&#19968;&#20010;&#20248;&#20808;&#65289;</td></tr><tr><td>namespace</td><td><tt class="literal">WebApplicationContext</tt>&#21629;&#21517;&#31354;&#38388;&#12290;&#32570;&#30465;&#26159;<tt class="literal">[server-name]-servlet</tt></td></tr></tbody></table></div></div><div class="sect1" lang="zh_cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mvc-controller"></a>12.3.&nbsp;&#25511;&#21046;&#22120;</h2></div></div><div></div></div><p>&#25511;&#21046;&#22120;&#30340;&#27010;&#24565;&#26159;MVC&#35774;&#35745;&#27169;&#24335;&#30340;&#19968;&#37096;&#20998;&#12290;&#25511;&#21046;&#22120;&#23450;&#20041;&#20102;&#24212;&#29992;&#30340;&#34892;&#20026;&#65292;&#33267;&#23569;&#33021;&#20351;&#29992;&#25143;&#35775;&#38382;&#21040;&#36825;&#20123;&#34892;&#20026;&#12290;&#25511;&#21046;&#22120;&#35299;&#37322;&#29992;&#25143;&#36755;&#20837;&#65292;&#24182;&#23558;&#20854;&#36716;&#25442;&#25104;&#21512;&#29702;&#30340;&#27169;&#22411;&#25968;&#25454;&#65292;&#20174;&#32780;&#21487;&#20197;&#36827;&#19968;&#27493;&#22320;&#30001;&#35270;&#22270;&#23637;&#31034;&#32473;&#29992;&#25143;&#12290;Spring&#20197;&#19968;&#31181;&#25277;&#35937;&#30340;&#26041;&#24335;&#23454;&#29616;&#20102;&#25511;&#21046;&#22120;&#27010;&#24565;&#65292;&#36825;&#26679;&#20351;&#24471;&#19981;&#21516;&#31867;&#22411;&#30340;&#25511;&#21046;&#22120;&#21487;&#20197;&#34987;&#21019;&#24314;&#12290;Spring&#21253;&#21547;&#34920;&#21333;&#25511;&#21046;&#22120;&#65292;&#21629;&#20196;&#25511;&#21046;&#22120;&#65292;&#25191;&#34892;&#21521;&#23548;&#36923;&#36753;&#30340;&#25511;&#21046;&#22120;&#31561;&#31561;&#12290;</p><p>Spring&#25511;&#21046;&#22120;&#26550;&#26500;&#30340;&#22522;&#30784;&#26159;<tt class="literal">org.springframework.mvc.Controller</tt>&#25509;&#21475;&#12290;</p><pre class="programlisting">public interface Controller {

    /**
     * Process the request and return a ModelAndView object which the DispatcherServlet
     * will render.
     */
    ModelAndView handleRequest(
        HttpServletRequest request, 
        HttpServletResponse response) 
    throws Exception;
}</pre><p> &#20320;&#21487;&#20197;&#21457;&#29616;Controller&#25509;&#21475;&#20165;&#20165;&#22768;&#26126;&#20102;&#19968;&#20010;&#26041;&#27861;&#65292;&#23427;&#33021;&#22815;&#22788;&#29702;&#35831;&#27714;&#24182;&#36820;&#22238;&#21512;&#36866;&#30340;&#27169;&#22411;&#21644;&#35270;&#22270;&#12290;Spring MVC&#23454;&#29616;&#30340;&#22522;&#30784;&#23601;&#26159;&#36825;&#19977;&#20010;&#27010;&#24565;&#65306;<span class="emphasis"><em>ModelAndView</em></span>&#21644;<span class="emphasis"><em>Controller</em></span>&#12290; &#22240;&#20026;Controller&#25509;&#21475;&#26159;&#23436;&#20840;&#25277;&#35937;&#30340;&#65292;Spring&#25552;&#20379;&#20102;&#35768;&#22810;&#24050;&#32463;&#21253;&#21547;&#19968;&#23450;&#21151;&#33021;&#30340;&#25511;&#21046;&#22120;&#12290;&#25511;&#21046;&#22120;&#25509;&#21475;&#20165;&#20165;&#23450;&#20041;&#20102;&#27599;&#20010;&#25511;&#21046;&#22120;&#25552;&#20379;&#30340;&#20849;&#21516;&#21151;&#33021;&#65306;&#22788;&#29702;&#35831;&#27714;&#24182;&#36820;&#22238;&#19968;&#20010;&#27169;&#22411;&#21644;&#19968;&#20010;&#35270;&#22270;&#12290;</p><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-controller-abstractcontroller"></a>12.3.1.&nbsp;AbstractController &#21644; WebContentGenerator</h3></div></div><div></div></div><p>&#24403;&#28982;&#65292;&#23601;&#19968;&#20010;&#25511;&#21046;&#22120;&#25509;&#21475;&#24182;&#19981;&#22815;&#12290;&#20026;&#20102;&#25552;&#20379;&#19968;&#22871;&#22522;&#30784;&#35774;&#26045;&#65292;&#25152;&#26377;&#30340;Spring&#25511;&#21046;&#22120;&#37117;&#20174; AbstractController &#32487;&#25215;&#65292;AbstractController &#25552;&#20379;&#32531;&#23384;&#21644;&#20854;&#23427;&#27604;&#22914; mimetype &#30340;&#35774;&#32622;&#30340;&#21151;&#33021;&#12290;</p><div class="table"><a name="mvc-controller-abstract-features"></a><p class="title"><b>&#34920;&nbsp;12.3.&nbsp;<tt class="literal">AbstractController</tt>&#25552;&#20379;&#30340;&#21151;&#33021;</b></p><table summary="AbstractController&#25552;&#20379;&#30340;&#21151;&#33021;" border="1"><colgroup><col><col></colgroup><thead><tr><th>&#21151;&#33021;</th><th>&#35299;&#37322;</th></tr></thead><tbody><tr><td><tt class="literal">supportedMethods</tt></td><td>&#25351;&#23450;&#36825;&#20010;&#25511;&#21046;&#22120;&#24212;&#35813;&#25509;&#21463;&#20160;&#20040;&#26679;&#30340;&#35831;&#27714;&#26041;&#27861;&#12290;&#36890;&#24120;&#23427;&#34987;&#35774;&#32622;&#25104;<tt class="literal">GET</tt>&#21644;<tt class="literal">POST</tt>&#65292;&#20294;&#26159;&#20320;&#21487;&#20197;&#36873;&#25321;&#20320;&#24819;&#25903;&#25345;&#30340;&#26041;&#27861;&#12290;&#22914;&#26524;&#25511;&#21046;&#22120;&#19981;&#25903;&#25345;&#35831;&#27714;&#21457;&#36865;&#30340;&#26041;&#27861;&#65292;&#23458;&#25143;&#31471;&#20250;&#24471;&#21040;&#36890;&#30693;&#65288;<tt class="literal">ServletException</tt>&#65289;</td></tr><tr><td><tt class="literal">requiresSession</tt></td><td>&#25351;&#23450;&#36825;&#20010;&#25511;&#21046;&#22120;&#26159;&#21542;&#38656;&#35201;&#20250;&#35805;&#12290;&#36825;&#20010;&#21151;&#33021;&#25552;&#20379;&#32473;&#25152;&#26377;&#25511;&#21046;&#22120;&#12290;&#22914;&#26524;&#25511;&#21046;&#22120;&#22312;&#27809;&#26377;&#20250;&#35805;&#30340;&#24773;&#20917;&#19979;&#25509;&#25910;&#21040;&#35831;&#27714;&#65292;&#29992;&#25143;&#34987;&#36890;&#30693;<tt class="literal">ServletException</tt></td></tr><tr><td><tt class="literal">synchronizeSession</tt></td><td>&#22914;&#26524;&#20320;&#38656;&#35201;&#20351;&#25511;&#21046;&#22120;&#21516;&#27493;&#35775;&#38382;&#29992;&#25143;&#20250;&#35805;&#65292;&#20351;&#29992;&#36825;&#20010;&#21442;&#25968;&#12290;&#20855;&#20307;&#22320;&#35828;&#65292;&#32487;&#25215;&#30340;&#25511;&#21046;&#22120;&#35201;&#37325;&#36733;<tt class="literal">handleRequestInternal</tt>&#26041;&#27861;&#65292;&#22914;&#26524;&#20320;&#25351;&#23450;&#20102;&#36825;&#20010;&#21464;&#37327;&#65292;&#25511;&#21046;&#22120;&#23601;&#34987;&#21516;&#27493;&#21270;&#12290;</td></tr><tr><td><tt class="literal">cacheSeconds</tt></td><td>&#24403;&#20320;&#38656;&#35201;&#25511;&#21046;&#22120;&#22312;HTTP&#21709;&#24212;&#20013;&#29983;&#25104;&#32531;&#23384;&#25351;&#20196;&#65292;&#29992;&#36825;&#21442;&#25968;&#25351;&#23450;&#19968;&#20010;&#22823;&#20110;&#38646;&#30340;&#25972;&#25968;&#12290;&#32570;&#30465;&#23427;&#34987;&#35774;&#32622;&#20026;<span class="emphasis"><em>-1</em></span>&#65292;&#25152;&#20197;&#23601;&#27809;&#26377;&#29983;&#25104;&#32531;&#23384;&#25351;&#20196;</td></tr><tr><td><tt class="literal">useExpiresHeader</tt></td><td>&#25351;&#23450;&#20320;&#30340;&#25511;&#21046;&#22120;&#20351;&#29992;HTTP 1.0&#20860;&#23481;&#30340;<span class="emphasis"><em>"Expires"</em></span>&#12290;&#32570;&#30465;&#20026;true&#65292;&#25152;&#20197;&#20320;&#21487;&#20197;&#19981;&#29992;&#20462;&#25913;&#23427;</td></tr><tr><td><tt class="literal">useCacheHeader</tt></td><td>&#25351;&#23450;&#20320;&#30340;&#25511;&#21046;&#22120;&#20351;&#29992;HTTP 1.0&#20860;&#23481;&#30340;<span class="emphasis"><em>"Cache-Control"</em></span>&#12290;&#32570;&#30465;&#20026;true&#65292;&#25152;&#20197;&#20320;&#20063;&#21487;&#20197;&#19981;&#29992;&#20462;&#25913;&#23427;</td></tr></tbody></table></div><p><span class="emphasis"><em>&#26368;&#21518;&#30340;&#20004;&#20010;&#23646;&#24615;&#26159;<tt class="literal">WebContentGenerator</tt>&#23450;&#20041;&#30340;&#65292;<tt class="literal">WebContentGenerator</tt>&#26159;<tt class="literal">AbstractController</tt>&#30340;&#36229;&#31867;&#8230;&#8230;</em></span></p><p>&#24403;&#20351;&#29992;AbstractController&#20316;&#20026;&#20320;&#30340;&#25511;&#21046;&#22120;&#22522;&#31867;&#26102;&#65288;&#19968;&#33324;<span class="emphasis"><em>&#19981;</em></span>&#25512;&#33616;&#36825;&#26679;&#20570;&#65292;&#22240;&#20026;&#26377;&#35768;&#22810;&#39044;&#23450;&#20041;&#30340;&#25511;&#21046;&#22120;&#20320;&#21487;&#20197;&#36873;&#25321;&#65289;&#65292;&#20320;&#21482;&#38656;&#35201;&#37325;&#36733;<tt class="literal">handleRequestInternal(HttpServletRequest,
      HttpServletResponse)</tt>&#36825;&#20010;&#26041;&#27861;&#65292;&#23454;&#29616;&#20320;&#33258;&#24049;&#30340;&#36923;&#36753;&#65292;&#24182;&#36820;&#22238;&#19968;&#20010;<tt class="literal">ModelAndView</tt>&#23545;&#35937;&#12290;&#19979;&#38754;&#36825;&#20010;&#31616;&#21333;&#20363;&#23376;&#21253;&#21547;&#19968;&#20010;&#31867;&#21644;&#22312;web&#24212;&#29992;&#19978;&#19979;&#25991;&#20013;&#30340;&#23450;&#20041;&#12290;
      </p><pre class="programlisting">package samples;

public class SampleController extends AbstractController {

    public ModelAndView handleRequestInternal(
        HttpServletRequest request,
        HttpServletResponse response)
    throws Exception {
        ModelAndView mav = new ModelAndView("foo", new HashMap());
    }
}</pre><p> </p><pre class="programlisting">&lt;bean id="sampleController" class="samples.SampleController"&gt;
    &lt;property name="cacheSeconds"&gt;&lt;value&gt;120&lt;/value&lt;/property&gt;
&lt;/bean&gt;</pre><p> &#38500;&#20102;&#36825;&#20010;&#31867;&#21644;&#22312;web&#24212;&#29992;&#19978;&#19979;&#25991;&#20013;&#30340;&#23450;&#20041;&#65292;&#36824;&#38656;&#35201;&#35774;&#32622;&#22788;&#29702;&#22120;&#26144;&#23556;&#65288;&#21442;&#32771;<a href="mvc.html#mvc-handlermapping" title="12.4.&nbsp;&#22788;&#29702;&#22120;&#26144;&#23556;">&#31532;&nbsp;12.4&nbsp;&#33410; &#8220;&#22788;&#29702;&#22120;&#26144;&#23556;&#8221;</a>&#65289;&#65292;&#36825;&#26679;&#36825;&#20010;&#31616;&#21333;&#30340;&#25511;&#21046;&#22120;&#23601;&#21487;&#20197;&#24037;&#20316;&#20102;&#12290;&#36825;&#20010;&#25511;&#21046;&#22120;&#23558;&#29983;&#25104;&#32531;&#23384;&#25351;&#20196;&#21578;&#35785;&#23458;&#25143;&#31471;&#32531;&#23384;&#25968;&#25454;2&#20998;&#38047;&#21518;&#20877;&#26816;&#26597;&#29366;&#24577;&#12290;&#36825;&#20010;&#25511;&#21046;&#22120;&#36824;&#36820;&#22238;&#20102;&#19968;&#20010;&#30828;&#32534;&#30721;&#30340;&#35270;&#22270;&#21517;&#65288;&#19981;&#26159;&#24456;&#22909;&#65289;&#65288;&#35814;&#24773;&#21442;&#32771;<a href="mvc.html#mvc-viewresolver" title="12.5.&nbsp;&#35270;&#22270;&#19982;&#35270;&#22270;&#35299;&#26512;">&#31532;&nbsp;12.5&nbsp;&#33410; &#8220;&#35270;&#22270;&#19982;&#35270;&#22270;&#35299;&#26512;&#8221;</a>&#65289;&#12290;</p></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-controller-othersimplecontrollers"></a>12.3.2.&nbsp;&#20854;&#23427;&#30340;&#31616;&#21333;&#25511;&#21046;&#22120;</h3></div></div><div></div></div><p>&#38500;&#20102;AbstractController&#8212;&#8212;&#34429;&#28982;&#26377;&#35768;&#22810;&#20854;&#20182;&#25511;&#21046;&#22120;&#21487;&#20197;&#25552;&#20379;&#32473;&#20320;&#26356;&#22810;&#30340;&#21151;&#33021;&#65292;&#20294;&#26159;&#20320;&#36824;&#26159;&#21487;&#20197;&#30452;&#25509;&#32487;&#25215;AbstractController&#8212;&#8212;&#26377;&#35768;&#22810;&#31616;&#21333;&#25511;&#21046;&#22120;&#65292;&#23427;&#20204;&#21487;&#20197;&#20943;&#36731;&#24320;&#21457;&#31616;&#21333;MVC&#24212;&#29992;&#26102;&#30340;&#36127;&#25285;&#12290;<tt class="literal">ParameterizableViewController</tt>&#22522;&#26412;&#19978;&#21644;&#19978;&#38754;&#20363;&#23376;&#20013;&#30340;&#19968;&#26679;&#65292;&#20294;&#26159;&#20320;&#21487;&#20197;&#25351;&#23450;&#36820;&#22238;&#30340;&#35270;&#22270;&#21517;&#65292;&#35270;&#22270;&#21517;&#23450;&#20041;&#22312;web&#24212;&#29992;&#19978;&#19979;&#25991;&#20013;&#65288;&#19981;&#38656;&#35201;&#30828;&#32534;&#30721;&#30340;&#35270;&#22270;&#21517;&#65289;</p><p><tt class="literal">FileNameViewController</tt>&#26816;&#26597;URL&#24182;&#33719;&#21462;&#25991;&#20214;&#35831;&#27714;&#30340;&#25991;&#20214;&#21517;&#65288;<tt class="literal">http://www.springframework.org/index.html</tt>&#30340;&#25991;&#20214;&#21517;&#26159;<tt class="literal">index</tt>&#65289;&#65292;&#25226;&#23427;&#20316;&#20026;&#35270;&#22270;&#21517;&#12290;&#20165;&#27492;&#32780;&#24050;&#12290;</p></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-controller-multiaction"></a>12.3.3.&nbsp;<tt class="literal">MultiActionController</tt></h3></div></div><div></div></div><p>Spring&#25552;&#20379;&#19968;&#20010;&#22810;&#21160;&#20316;&#25511;&#21046;&#22120;&#65292;&#20351;&#29992;&#23427;&#20320;&#21487;&#20197;&#23558;&#20960;&#20010;&#21160;&#20316;&#21512;&#24182;&#22312;&#19968;&#20010;&#25511;&#21046;&#22120;&#37324;&#65292;&#36825;&#26679;&#21487;&#20197;&#25226;&#21151;&#33021;&#32452;&#21512;&#22312;&#19968;&#36215;&#12290;&#22810;&#21160;&#20316;&#25511;&#21046;&#22120;&#23384;&#22312;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#21253;&#20013;&#8212;&#8212;<tt class="literal">org.springframework.web.mvc.multiaction</tt>&#8212;&#8212;&#23427;&#33021;&#22815;&#23558;&#35831;&#27714;&#26144;&#23556;&#21040;&#26041;&#27861;&#21517;&#65292;&#28982;&#21518;&#35843;&#29992;&#27491;&#30830;&#30340;&#26041;&#27861;&#12290;&#27604;&#22914;&#24403;&#20320;&#22312;&#19968;&#20010;&#25511;&#21046;&#22120;&#20013;&#26377;&#24456;&#22810;&#20844;&#20849;&#30340;&#21151;&#33021;&#65292;&#20294;&#26159;&#24819;&#22810;&#20010;&#20837;&#21475;&#21040;&#25511;&#21046;&#22120;&#20351;&#29992;&#19981;&#21516;&#30340;&#34892;&#20026;&#65292;&#20351;&#29992;&#22810;&#21160;&#20316;&#25511;&#21046;&#22120;&#23601;&#29305;&#21035;&#26041;&#20415;&#12290;</p><div class="table"><a name="mvc-controller-multiaction-features"></a><p class="title"><b>&#34920;&nbsp;12.4.&nbsp;<tt class="literal">MultiActionController</tt>&#25552;&#20379;&#30340;&#21151;&#33021;</b></p><table summary="MultiActionController&#25552;&#20379;&#30340;&#21151;&#33021;" border="1"><colgroup><col><col></colgroup><thead><tr><th>&#21151;&#33021;</th><th>&#35299;&#37322;</th></tr></thead><tbody><tr><td><tt class="literal">delegate</tt></td><td>MultiActionController&#26377;&#20004;&#31181;&#20351;&#29992;&#26041;&#24335;&#12290;&#31532;&#19968;&#31181;&#26159;&#32487;&#25215;MultiActionController&#65292;&#24182;&#22312;&#23376;&#31867;&#20013;&#25351;&#23450;&#30001;MethodNameResolver&#35299;&#26512;&#30340;&#26041;&#27861;&#65288;&#36825;&#31181;&#24773;&#20917;&#19979;&#19981;&#38656;&#35201;&#36825;&#20010;&#37197;&#32622;&#21442;&#25968;&#65289;&#65292;&#31532;&#20108;&#31181;&#26159;&#20320;&#23450;&#20041;&#20102;&#19968;&#20010;&#20195;&#29702;&#23545;&#35937;&#65292;&#30001;&#23427;&#35843;&#29992;Resolver&#35299;&#26512;&#30340;&#26041;&#27861;&#12290;&#22914;&#26524;&#20320;&#26159;&#36825;&#31181;&#24773;&#20917;&#65292;&#20320;&#24517;&#39035;&#20351;&#29992;&#36825;&#20010;&#37197;&#32622;&#21442;&#25968;&#23450;&#20041;&#20195;&#29702;&#23545;&#35937;</td></tr><tr><td><tt class="literal">methodNameResolver</tt></td><td>&#30001;&#20110;&#26576;&#31181;&#21407;&#22240;&#65292;MultiActionController&#38656;&#35201;&#22522;&#20110;&#25910;&#21040;&#30340;&#35831;&#27714;&#35299;&#26512;&#23427;&#24517;&#39035;&#35843;&#29992;&#30340;&#26041;&#27861;&#12290;&#20320;&#21487;&#20197;&#20351;&#29992;&#36825;&#20010;&#37197;&#32622;&#21442;&#25968;&#23450;&#20041;&#19968;&#20010;&#35299;&#26512;&#22120;</td></tr></tbody></table></div><p>&#19968;&#20010;&#22810;&#21160;&#20316;&#25511;&#21046;&#22120;&#30340;&#26041;&#27861;&#38656;&#35201;&#31526;&#21512;&#19979;&#21015;&#26684;&#24335;&#65306;</p><pre class="programlisting">// actionName can be replaced by any methodname
ModelAndView actionName(HttpServletRequest, HttpServletResponse);</pre><p>&#30001;&#20110;MultiActionController&#19981;&#33021;&#21028;&#26029;&#26041;&#27861;&#37325;&#36733;&#65288;overloading&#65289;&#65292;&#25152;&#20197;&#26041;&#27861;&#37325;&#36733;&#26159;&#19981;&#20801;&#35768;&#30340;&#12290;&#27492;&#22806;&#65292;&#20320;&#21487;&#20197;&#23450;&#20041;<span class="emphasis"><em>exception handlers</em></span>&#65292;&#23427;&#33021;&#22815;&#22788;&#29702;&#20174;&#20320;&#25351;&#23450;&#30340;&#26041;&#27861;&#20013;&#25243;&#20986;&#30340;&#24322;&#24120;&#12290;&#21253;&#21547;&#24322;&#24120;&#22788;&#29702;&#30340;&#21160;&#20316;&#26041;&#27861;&#38656;&#35201;&#36820;&#22238;&#19968;&#20010;ModelAndView&#23545;&#35937;&#65292;&#23601;&#35937;&#20854;&#23427;&#21160;&#20316;&#26041;&#27861;&#19968;&#26679;&#65292;&#24182;&#31526;&#21512;&#19979;&#38754;&#30340;&#26684;&#24335;&#65306;</p><pre class="programlisting">// anyMeaningfulName can be replaced by any methodname
ModelAndView anyMeaningfulName(HttpServletRequest, HttpServletResponse, ExceptionClass);</pre><p> <tt class="literal">ExceptionClass</tt>&#21487;&#20197;&#26159;<span class="emphasis"><em>&#20219;&#20309;</em></span>&#24322;&#24120;&#65292;&#21482;&#35201;&#23427;&#26159;<tt class="literal">java.lang.Exception</tt>&#25110;<tt class="literal">java.lang.RuntimeException</tt>&#30340;&#23376;&#31867;&#12290;</p><p><tt class="literal">MethodNameResolver</tt>&#26681;&#25454;&#25910;&#21040;&#30340;&#35831;&#27714;&#35299;&#26512;&#26041;&#27861;&#21517;&#12290;&#26377;&#19977;&#31181;&#35299;&#26512;&#22120;&#21487;&#20197;&#20379;&#20320;&#36873;&#25321;&#65292;&#24403;&#28982;&#20320;&#21487;&#20197;&#33258;&#24049;&#23454;&#29616;&#35299;&#26512;&#22120;&#12290;</p><div class="itemizedlist"><ul type="disc" compact><li><p><tt class="literal">ParameterMethodNameResolver</tt> &#65293; &#35299;&#26512;&#35831;&#27714;&#21442;&#25968;&#65292;&#24182;&#23558;&#23427;&#20316;&#20026;&#26041;&#27861;&#21517;&#65288;<tt class="literal">http://www.sf.net/index.view?testParam=testIt</tt>&#30340;&#35831;&#27714;&#23601;&#20250;&#35843;&#29992;<tt class="literal">testIt(HttpServletRequest,HttpServletResponse)</tt>&#65289;&#12290;&#20351;&#29992;<tt class="literal">paramName</tt>&#37197;&#32622;&#21442;&#25968;&#21487;&#20197;&#35843;&#25972;&#25152;&#26816;&#26597;&#30340;&#21442;&#25968;</p></li><li><p><tt class="literal">InternalPathMethodNameResolver</tt> &#65293; &#20174;&#36335;&#24452;&#20013;&#33719;&#21462;&#25991;&#20214;&#21517;&#20316;&#20026;&#26041;&#27861;&#21517;&#65288;<tt class="literal">http://www.sf.net/testing.view</tt>&#30340;&#35831;&#27714;&#20250;&#35843;&#29992;<tt class="literal">testing(HttpServletRequest,
            HttpServletResponse)</tt>&#26041;&#27861;&#65289;</p></li><li><p><tt class="literal">PropertiesMethodNameResolver</tt> &#65293; &#20351;&#29992;&#29992;&#25143;&#23450;&#20041;&#30340;&#23646;&#24615;&#23545;&#35937;&#23558;&#35831;&#27714;&#30340;URL&#26144;&#23556;&#21040;&#26041;&#27861;&#21517;&#12290;&#24403;&#23646;&#24615;&#23450;&#20041;<tt class="literal">/index/welcome.html=doIt</tt>&#65292;&#24182;&#19988;&#25910;&#21040;<tt class="literal">/index/welcome.html</tt>&#30340;&#35831;&#27714;&#65292;&#23601;&#35843;&#29992;<tt class="literal">doIt(HttpServletRequest, HttpServletResponse)</tt>&#26041;&#27861;&#12290;&#36825;&#20010;&#26041;&#27861;&#21517;&#35299;&#26512;&#22120;&#38656;&#35201;&#20351;&#29992;<tt class="literal">PathMatcher</tt>&#65288;&#21442;&#32771; <a href="mvc.html#mvc-utilities-pathmatching" title="12.10.1.&nbsp;&#20851;&#20110;pathmatcher&#30340;&#23567;&#25925;&#20107;">&#31532;&nbsp;12.10.1&nbsp;&#33410; &#8220;&#20851;&#20110;pathmatcher&#30340;&#23567;&#25925;&#20107;&#8221;</a>&#65289;&#25152;&#20197;&#22914;&#26524;&#23646;&#24615;&#21253;&#21547;<tt class="literal">/**/welcom?.html</tt>&#65292;&#35813;&#26041;&#27861;&#20063;&#20250;&#34987;&#35843;&#29992;&#65281;</p></li></ul></div><p>&#25105;&#20204;&#26469;&#30475;&#19968;&#32452;&#20363;&#23376;&#12290;&#39318;&#20808;&#26159;&#19968;&#20010;&#20351;&#29992;<tt class="literal">ParameterMethodNameResolver</tt>&#21644;&#20195;&#29702;&#23646;&#24615;&#30340;&#20363;&#23376;&#65292;&#23427;&#25509;&#21463;&#21253;&#21547;&#21442;&#25968;&#21517;&#30340;&#35831;&#27714;&#65292;&#35843;&#29992;&#26041;&#27861;<tt class="literal">retrieveIndex</tt>: </p><pre class="programlisting">&lt;bean id="paramResolver" class="org....mvc.multiaction.ParameterMethodNameResolver"&gt;
    &lt;property name="paramName"&gt;&lt;value&gt;method&lt;/value&gt;&lt;/property&gt;
&lt;/bean&gt;

&lt;bean id="paramMultiController" class="org....mvc.multiaction.MultiActionController"&gt;
    &lt;property name="methodNameResolver"&gt;&lt;ref bean="paramResolver"/&gt;&lt;/property&gt;
    &lt;property name="delegate"&gt;&lt;ref bean="sampleDelegate"/&gt;
&lt;/bean&gt;

&lt;bean id="sampleDelegate" class="samples.SampleDelegate"/&gt;

## together with

public class SampleDelegate {

    public ModelAndView retrieveIndex(
        HttpServletRequest req, 
        HttpServletResponse resp) {

        rerurn new ModelAndView("index", "date", new Long(System.currentTimeMillis()));
    }
}</pre><p> &#24403;&#20351;&#29992;&#19978;&#38754;&#30340;&#20195;&#29702;&#23545;&#35937;&#26102;&#65292;&#25105;&#20204;&#20063;&#21487;&#20197;&#20351;&#29992;<tt class="literal">PropertiesMethodNameRseolver</tt>&#26469;&#21305;&#37197;&#19968;&#32452;URL&#65292;&#23558;&#23427;&#20204;&#26144;&#23556;&#21040;&#25105;&#20204;&#23450;&#20041;&#30340;&#26041;&#27861;&#19978;&#65306;</p><pre class="programlisting">&lt;bean id="propsResolver" class="org....mvc.multiaction.PropertiesMethodNameResolver"&gt;
    &lt;property name="mappings"&gt;
        &lt;props&gt;
            &lt;prop key="/index/welcome.html"&gt;retrieveIndex&lt;/prop&gt;
            &lt;prop key="/**/notwelcome.html"&gt;retrieveIndex&lt;/prop&gt;
            &lt;prop key="/*/user?.html"&gt;retrieveIndex&lt;/prop&gt;
        &lt;/props&gt;
    &lt;/property&gt;
&lt;/bean&gt;

&lt;bean id="paramMultiController" class="org....mvc.multiaction.MultiActionController"&gt;
    &lt;property name="methodNameResolver"&gt;&lt;ref bean="propsResolver"/&gt;&lt;/property&gt;
    &lt;property name="delegate"&gt;&lt;ref bean="sampleDelegate"/&gt;
&lt;/bean&gt;</pre></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-controller-command"></a>12.3.4.&nbsp;&#21629;&#20196;&#25511;&#21046;&#22120;</h3></div></div><div></div></div><p>Spring&#30340;<span class="emphasis"><em>CommandControllers</em></span>&#26159;Spring
       MVC&#21253;&#30340;&#37325;&#35201;&#37096;&#20998;&#12290;&#21629;&#20196;&#25511;&#21046;&#22120;&#25552;&#20379;&#20102;&#19968;&#31181;&#21644;&#25968;&#25454;&#23545;&#35937;&#20132;&#20114;&#30340;&#26041;&#24335;&#65292;&#24182;&#21160;&#24577;&#23558;&#26469;&#33258;<tt class="literal">HttpServletRequest</tt>&#30340;&#21442;&#25968;&#32465;&#23450;&#21040;&#20320;&#25351;&#23450;&#30340;&#25968;&#25454;&#23545;&#35937;&#19978;&#12290;&#21644;Struts&#30340;actonform&#30456;&#27604;&#65292;&#22312;Spring&#20013;&#65292;&#20320;&#19981;&#38656;&#35201;&#23454;&#29616;&#20219;&#20309;&#25509;&#21475;&#26469;&#23454;&#29616;&#25968;&#25454;&#32465;&#23450;&#12290;&#39318;&#20808;&#65292;&#35753;&#25105;&#20204;&#30475;&#19968;&#19979;&#26377;&#21738;&#20123;&#21487;&#20197;&#20351;&#29992;&#30340;&#21629;&#20196;&#25511;&#21046;&#22120;&#65292;&#20197;&#20415;&#26377;&#19968;&#20010;&#28165;&#26224;&#30340;&#20102;&#35299;&#65306; </p><div class="itemizedlist"><ul type="disc" compact><li><p><tt class="literal">AbstractCommandController</tt> - &#20320;&#21487;&#20197;&#20351;&#29992;&#36825;&#20010;&#21629;&#20196;&#25511;&#21046;&#22120;&#26469;&#21019;&#24314;&#20320;&#33258;&#24049;&#30340;&#21629;&#20196;&#25511;&#21046;&#22120;&#65292;&#23427;&#33021;&#22815;&#23558;&#35831;&#27714;&#21442;&#25968;&#32465;&#23450;&#21040;&#20320;&#25351;&#23450;&#30340;&#25968;&#25454;&#23545;&#35937;&#12290;&#36825;&#20010;&#31867;&#24182;&#19981;&#25552;&#20379;&#20219;&#20309;&#34920;&#21333;&#21151;&#33021;&#65292;&#20294;&#26159;&#23427;&#25552;&#20379;&#39564;&#35777;&#21151;&#33021;&#65292;&#24182;&#19988;&#35753;&#20320;&#22312;&#25511;&#21046;&#22120;&#20013;&#23450;&#20041;&#22914;&#20309;&#22788;&#29702;&#21253;&#21547;&#35831;&#27714;&#21442;&#25968;&#30340;&#25968;&#25454;&#23545;&#35937;&#12290;</p></li><li><p><tt class="literal">AbstractFormController</tt> - &#19968;&#20010;&#25552;&#20379;&#34920;&#21333;&#25552;&#20132;&#25903;&#25345;&#30340;&#25511;&#21046;&#22120;&#12290;&#20351;&#29992;&#36825;&#20010;&#25511;&#21046;&#22120;&#65292;&#20320;&#21487;&#20197;&#23450;&#20041;&#34920;&#21333;&#65292;&#24182;&#20351;&#29992;&#20320;&#20174;&#25511;&#21046;&#22120;&#33719;&#21462;&#30340;&#25968;&#25454;&#23545;&#35937;&#26500;&#24314;&#34920;&#21333;&#12290;&#24403;&#29992;&#25143;&#36755;&#20837;&#34920;&#21333;&#20869;&#23481;&#65292;AbstractFormController&#23558;&#29992;&#25143;&#36755;&#20837;&#30340;&#20869;&#23481;&#32465;&#23450;&#21040;&#25968;&#25454;&#23545;&#35937;&#65292;&#39564;&#35777;&#36825;&#20123;&#20869;&#23481;&#65292;&#24182;&#23558;&#23545;&#35937;&#20132;&#32473;&#25511;&#21046;&#22120;&#65292;&#23436;&#25104;&#36866;&#24403;&#30340;&#21160;&#20316;&#12290;&#23427;&#25152;&#25903;&#25345;&#30340;&#21151;&#33021;&#26377;&#26080;&#25928;&#34920;&#21333;&#25552;&#20132;&#65288;&#20877;&#27425;&#25552;&#20132;&#65289;&#65292;&#39564;&#35777;&#65292;&#21644;&#27491;&#30830;&#30340;&#34920;&#21333;&#24037;&#20316;&#27969;&#12290;&#20320;&#21487;&#20197;&#25511;&#21046;&#23558;&#20160;&#20040;&#35270;&#22270;&#32465;&#23450;&#21040;&#20320;&#30340;AbstractFormController&#12290;&#22914;&#26524;&#20320;&#38656;&#35201;&#34920;&#21333;&#65292;&#20294;&#19981;&#24819;&#22312;&#24212;&#29992;&#19978;&#19979;&#25991;&#20013;&#25351;&#23450;&#26174;&#31034;&#32473;&#29992;&#25143;&#30340;&#35270;&#22270;&#65292;&#23601;&#20351;&#29992;&#36825;&#20010;&#25511;&#21046;&#22120;&#12290;</p></li><li><p><tt class="literal">SimpleFormController</tt> - &#36825;&#26159;&#19968;&#20010;&#26356;&#20855;&#20307;&#30340;FormCotnroller&#65292;&#23427;&#33021;&#29992;&#30456;&#24212;&#30340;&#25968;&#25454;&#23545;&#35937;&#24110;&#21161;&#20320;&#21019;&#24314;&#34920;&#21333;&#12290;SimpleFormController&#35753;&#20320;&#25351;&#23450;&#19968;&#20010;&#21629;&#20196;&#23545;&#35937;&#65292;&#34920;&#21333;&#35270;&#22270;&#21517;&#65292;&#24403;&#34920;&#21333;&#25552;&#20132;&#25104;&#21151;&#21518;&#26174;&#31034;&#32473;&#29992;&#25143;&#30340;&#35270;&#22270;&#21517;&#31561;&#31561;&#12290;</p></li><li><p><tt class="literal">WizardFormController</tt> - &#26368;&#21518;&#19968;&#20010;&#20063;&#26159;&#21151;&#33021;&#26368;&#24378;&#30340;&#25511;&#21046;&#22120;&#12290;WizardFormController &#20801;&#35768;&#20320;&#20197;&#21521;&#23548;&#39118;&#26684;&#22788;&#29702;&#25968;&#25454;&#23545;&#35937;&#65292;&#24403;&#20351;&#29992;&#22823;&#30340;&#25968;&#25454;&#23545;&#35937;&#26102;&#65292;&#36825;&#26679;&#30340;&#26041;&#24335;&#30456;&#24403;&#26041;&#20415;&#12290;</p></li></ul></div></div></div><div class="sect1" lang="zh_cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mvc-handlermapping"></a>12.4.&nbsp;&#22788;&#29702;&#22120;&#26144;&#23556;</h2></div></div><div></div></div><p>&#20351;&#29992;&#22788;&#29702;&#22120;&#26144;&#23556;&#65292;&#20320;&#21487;&#20197;&#23558;web&#35831;&#27714;&#26144;&#23556;&#21040;&#27491;&#30830;&#30340;&#22788;&#29702;&#22120;&#19978;&#12290;&#26377;&#24456;&#22810;&#22788;&#29702;&#22120;&#26144;&#23556;&#20320;&#21487;&#20197;&#20351;&#29992;&#65292;&#20363;&#22914;&#65306;<tt class="literal">SimpleUrlHandlerMapping</tt>&#25110;&#32773;<tt class="literal">BeanNameUrlHandlerMapping</tt>&#65292;&#20294;&#26159;&#20808;&#35753;&#25105;&#20204;&#30475;&#19968;&#19979;<tt class="literal">HandlerMapping</tt>&#30340;&#22522;&#26412;&#27010;&#24565;&#12290;</p><p>&#19968;&#20010;&#22522;&#26412;&#30340;<tt class="literal">HandlerMapping</tt>&#25152;&#25552;&#20379;&#30340;&#21151;&#33021;&#26159;&#23558;&#35831;&#27714;&#20256;&#36882;&#21040;<tt class="literal">HandlerExecutionChain</tt>&#19978;&#65292;&#39318;&#20808;<tt class="literal">HandlerExecutionChain</tt>&#21253;&#21547;&#19968;&#20010;&#31526;&#21512;&#36755;&#20837;&#35831;&#27714;&#30340;&#22788;&#29702;&#22120;&#12290;&#20854;&#27425;&#65288;&#20294;&#26159;&#21487;&#36873;&#30340;&#65289;&#26159;&#19968;&#20010;&#21487;&#20197;&#25318;&#25130;&#35831;&#27714;&#30340;&#25318;&#25130;&#22120;&#21015;&#34920;&#12290;&#24403;&#25910;&#21040;&#35831;&#27714;&#65292;<tt class="literal">DispatcherServlet</tt>&#23558;&#35831;&#27714;&#20132;&#32473;&#22788;&#29702;&#22120;&#26144;&#23556;&#65292;&#35753;&#23427;&#26816;&#26597;&#35831;&#27714;&#24182;&#33719;&#24471;&#19968;&#20010;&#27491;&#30830;&#30340;<tt class="literal">HandlerExecutionChain</tt>&#12290;&#28982;&#21518;&#65292;&#25191;&#34892;&#23450;&#20041;&#22312;&#25191;&#34892;&#38142;&#20013;&#30340;&#22788;&#29702;&#22120;&#21644;&#25318;&#25130;&#22120;&#65288;&#22914;&#26524;&#26377;&#25318;&#25130;&#22120;&#30340;&#35805;&#65289;</p><p>&#21253;&#21547;&#25318;&#25130;&#22120;&#65288;&#22788;&#29702;&#22120;&#25191;&#34892;&#21069;&#65292;&#25191;&#34892;&#21518;&#65292;&#25110;&#32773;&#25191;&#34892;&#21069;&#21518;&#65289;&#30340;&#21487;&#37197;&#32622;&#30340;&#22788;&#29702;&#22120;&#26144;&#23556;&#21151;&#33021;&#38750;&#24120;&#24378;&#22823;&#12290;&#35768;&#22810;&#21151;&#33021;&#34987;&#25918;&#32622;&#22312;&#33258;&#23450;&#20041;&#30340;<tt class="literal">HandlerMappings</tt>&#20013;&#12290;&#19968;&#20010;&#33258;&#23450;&#20041;&#30340;&#22788;&#29702;&#22120;&#26144;&#23556;&#19981;&#20165;&#26681;&#25454;&#35831;&#27714;&#30340;URL&#65292;&#32780;&#19988;&#36824;&#21487;&#20197;&#26681;&#25454;&#21644;&#35831;&#27714;&#30456;&#20851;&#30340;&#20250;&#35805;&#29366;&#24577;&#26469;&#36873;&#25321;&#22788;&#29702;&#22120;&#12290;</p><p>&#25105;&#20204;&#26469;&#30475;&#30475;Spring&#25552;&#20379;&#30340;&#22788;&#29702;&#22120;&#26144;&#23556;&#12290;</p><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-handlermapping-beanname"></a>12.4.1.&nbsp;<tt class="literal">BeanNameUrlHandlerMapping</tt></h3></div></div><div></div></div><p><tt class="literal">BeanNameUrlHandlerMapping</tt>&#26159;&#19968;&#20010;&#31616;&#21333;&#20294;&#24456;&#24378;&#22823;&#30340;&#22788;&#29702;&#22120;&#26144;&#23556;&#65292;&#23427;&#23558;&#25910;&#21040;&#30340;HTTP&#35831;&#27714;&#26144;&#23556;&#21040;&#22312;web&#24212;&#29992;&#19978;&#19979;&#25991;&#20013;&#23450;&#20041;&#30340;bean&#30340;&#21517;&#23383;&#19978;&#12290;&#22914;&#26524;&#25105;&#20204;&#24819;&#35201;&#20351;&#29992;&#25143;&#25554;&#20837;&#19968;&#20010;&#36134;&#25143;&#65292;&#24182;&#19988;&#20551;&#35774;&#25105;&#20204;&#25552;&#20379;&#20102;FormController&#65288;&#20851;&#20110;CommandController&#21644;FormController&#35831;&#21442;&#32771;<a href="mvc.html#mvc-controller-command" title="12.3.4.&nbsp;&#21629;&#20196;&#25511;&#21046;&#22120;">&#31532;&nbsp;12.3.4&nbsp;&#33410; &#8220;&#21629;&#20196;&#25511;&#21046;&#22120;&#8221;</a>&#65289;&#21644;&#26174;&#31034;&#34920;&#21333;&#30340;JSP&#35270;&#22270;&#65288;&#25110;Velocity&#27169;&#29256;&#65289;&#12290;&#24403;&#20351;&#29992;BeanNameUrlHandlerMapping&#26102;&#65292;&#25105;&#20204;&#29992;&#19979;&#38754;&#30340;&#37197;&#32622;&#33021;&#23558;&#21253;&#21547;URL <tt class="literal">http://samples.com/editaccount.form</tt>&#30340;HTTP&#35831;&#27714;&#26144;&#23556;&#21040;&#21512;&#36866;&#30340;FormController&#19978;&#65306;</p><pre class="programlisting">&lt;beans&gt;
    &lt;bean id="handlerMapping" 
          class="org.springframework.web.servlet.handler.BeanNameUrlHandlerMapping"/&gt;
        
    &lt;bean name="/editaccount.form"
          class="org.springframework.web.servlet.mvc.SimpleFormController"&gt;
        &lt;property name="formView"&gt;&lt;value&gt;account&lt;/value&gt;&lt;/property&gt;
        &lt;property name="successView"&gt;&lt;value&gt;account-created&lt;/value&gt;&lt;/property&gt;
        &lt;property name="commandName"&gt;&lt;value&gt;Account&lt;/value&gt;&lt;/property&gt;
        &lt;property name="commandClass"&gt;&lt;value&gt;samples.Account&lt;/value&gt;&lt;/property&gt;
    &lt;/bean&gt;
&lt;beans&gt;    </pre><p> &#25152;&#26377;<tt class="literal">/editaccount.form</tt>&#30340;&#35831;&#27714;&#23601;&#20250;&#30001;&#19978;&#38754;&#30340;FormController&#22788;&#29702;&#12290;&#24403;&#28982;&#25105;&#20204;&#24471;&#22312;web.xml&#20013;&#23450;&#20041;servlet-mapping&#65292;&#25509;&#21463;&#25152;&#26377;&#20197;.form&#32467;&#23614;&#30340;&#35831;&#27714;&#12290;</p><pre class="programlisting">&lt;web-app&gt;
    ...
    &lt;servlet&gt;
        &lt;servlet-name&gt;sample&lt;/servlet-name&gt;
        &lt;servlet-class&gt;org.springframework.web.servlet.DispatcherServlet&lt;/servlet-class&gt;
        &lt;load-on-startup&gt;1&lt;/load-on-startup&gt;
    &lt;/servlet&gt;

   &lt;!-- Maps the sample dispatcher to /*.form --&gt;
    &lt;servlet-mapping&gt;
        &lt;servlet-name&gt;sample&lt;/servlet-name&gt;
        &lt;url-pattern&gt;*.form&lt;/url-pattern&gt;
    &lt;/servlet-mapping&gt;
    ...
&lt;/web-app&gt;</pre><p><span class="emphasis"><em>&#27880;&#24847;&#65306;&#22914;&#26524;&#20320;&#20351;&#29992;<tt class="literal">BeanNameUrlHandlerMapping</tt>&#65292;&#20320;&#19981;&#24517;&#22312;web&#24212;&#29992;&#19978;&#19979;&#25991;&#20013;&#23450;&#20041;&#23427;&#12290;&#32570;&#30465;&#24773;&#20917;&#19979;&#65292;&#22914;&#26524;&#22312;&#19978;&#19979;&#25991;&#20013;&#27809;&#26377;&#25214;&#21040;&#22788;&#29702;&#22120;&#26144;&#23556;&#65292;DispatcherServlet&#20250;&#20026;&#20320;&#21019;&#24314;&#19968;&#20010;<tt class="literal">BeanNameUrlHandlerMapping</tt>&#65281;</em></span></p></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-handlermapping-urlhandlermapping"></a>12.4.2.&nbsp;<tt class="literal">SimpleUrlHandlerMapping</tt></h3></div></div><div></div></div><p>&#21478;&#19968;&#20010;&#8212;&#8212;&#26356;&#24378;&#22823;&#30340;&#22788;&#29702;&#22120;&#26144;&#23556;&#8212;&#8212;&#26159;<tt class="literal">SimpleUrlHandlerMapping</tt>&#12290;&#23427;&#22312;&#24212;&#29992;&#19978;&#19979;&#25991;&#20013;&#21487;&#20197;&#37197;&#32622;&#65292;&#24182;&#19988;&#26377;Ant&#39118;&#26684;&#30340;&#36335;&#24452;&#21305;&#37197;&#21151;&#33021;&#65288;&#21442;&#32771;<a href="mvc.html#mvc-utilities-pathmatching" title="12.10.1.&nbsp;&#20851;&#20110;pathmatcher&#30340;&#23567;&#25925;&#20107;">&#31532;&nbsp;12.10.1&nbsp;&#33410; &#8220;&#20851;&#20110;pathmatcher&#30340;&#23567;&#25925;&#20107;&#8221;</a>&#65289;&#12290;&#19979;&#38754;&#20960;&#20010;&#20363;&#23376;&#21487;&#20197;&#24110;&#21161;&#29702;&#35299;&#65306; </p><pre class="programlisting">&lt;web-app&gt;
    ...
    &lt;servlet&gt;
        &lt;servlet-name&gt;sample&lt;/servlet-name&gt;
        &lt;servlet-class&gt;org.springframework.web.servlet.DispatcherServlet&lt;/servlet-class&gt;
        &lt;load-on-startup&gt;1&lt;/load-on-startup&gt;
    &lt;/servlet&gt;

    &lt;!-- Maps the sample dispatcher to /*.form --&gt;
    &lt;servlet-mapping&gt;
        &lt;servlet-name&gt;sample&lt;/servlet-name&gt;
        &lt;url-pattern&gt;*.form&lt;/url-pattern&gt;
    &lt;/servlet-mapping&gt;
    &lt;servlet-mapping&gt;
        &lt;servlet-name&gt;sample&lt;/servlet-name&gt;
        &lt;url-pattern&gt;*.html&lt;/url-pattern&gt;
    &lt;/servlet-mapping&gt;
    ...
&lt;/web-app&gt;</pre><p> &#20801;&#35768;&#25152;&#26377;&#20197;.html&#21644;.form&#32467;&#23614;&#30340;&#35831;&#27714;&#37117;&#30001;&#36825;&#20010;&#31034;&#20363;dispatchservelt&#22788;&#29702;&#12290;</p><pre class="programlisting">&lt;beans&gt;
    &lt;bean id="handlerMapping" 
          class="org.springframework.web.servlet.handler.SimpleUrlHandlerMapping"&gt;            
        &lt;property name="mappings"&gt;
            &lt;props&gt;
                &lt;prop key="/*/account.form"&gt;editAccountFormController&lt;/prop&gt;
                &lt;prop key="/*/editaccount.form"&gt;editAccountFormController&lt;/prop&gt;
                &lt;prop key="/ex/view*.html"&gt;someViewController&lt;/prop&gt;
                &lt;prop key="/**/help.html"&gt;helpController&lt;/prop&gt;
            &lt;/props&gt;
        &lt;/property&gt;
    &lt;/bean&gt;
    
    &lt;bean id="someViewController"
          class="org.springframework.web.servlet.mvc.FilenameViewController"/&gt;
    
    &lt;bean id="editAccountFormController"
          class="org.springframework.web.servlet.mvc.SimpleFormController"&gt;
        &lt;property name="formView"&gt;&lt;value&gt;account&lt;/value&gt;&lt;/property&gt;
        &lt;property name="successView"&gt;&lt;value&gt;account-created&lt;/value&gt;&lt;/property&gt;
        &lt;property name="commandName"&gt;&lt;value&gt;Account&lt;/value&gt;&lt;/property&gt;
        &lt;property name="commandClass"&gt;&lt;value&gt;samples.Account&lt;/value&gt;&lt;/property&gt;
    &lt;/bean&gt;
&lt;beans&gt;</pre><p> &#36825;&#20010;&#22788;&#29702;&#22120;&#26144;&#23556;&#39318;&#20808;&#23558;&#25152;&#26377;&#30446;&#24405;&#20013;&#25991;&#20214;&#21517;&#20026;<tt class="literal">help.html</tt>&#30340;&#35831;&#27714;&#20256;&#36882;&#32473;<tt class="literal">helpController</tt>&#65288;&#35793;&#27880;&#65292;&#21407;&#25991;&#20026;<tt class="literal">someViewController</tt>&#65289;&#65292;<tt class="literal">someViewController</tt>&#26159;&#19968;&#20010;FilenameViewController&#65288;&#26356;&#22810;&#20449;&#24687;&#35831;&#21442;&#32771;<a href="mvc.html#mvc-controller" title="12.3.&nbsp;&#25511;&#21046;&#22120;">&#31532;&nbsp;12.3&nbsp;&#33410; &#8220;&#25511;&#21046;&#22120;&#8221;</a>&#65289;&#12290;&#25152;&#26377;<tt class="literal">ex</tt>&#30446;&#24405;&#20013;&#36164;&#28304;&#21517;&#20197;<tt class="literal">view</tt>&#24320;&#22987;&#65292;<tt class="literal">.html</tt>&#32467;&#23614;&#30340;&#35831;&#27714;&#37117;&#20250;&#34987;&#20256;&#36882;&#32473;&#25511;&#21046;&#22120;&#12290;&#36825;&#37324;&#23450;&#20041;&#20102;&#20004;&#20010;&#20351;&#29992;<tt class="literal">editAccountFormController</tt>&#30340;&#22788;&#29702;&#22120;&#26144;&#23556;&#12290;</p></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-handlermapping-interceptor"></a>12.4.3.&nbsp;&#28155;&#21152;<tt class="literal">HandlerInterceptors</tt></h3></div></div><div></div></div><p>&#22788;&#29702;&#22120;&#26144;&#23556;&#25552;&#20379;&#20102;&#25318;&#25130;&#22120;&#27010;&#24565;&#65292;&#24403;&#20320;&#24819;&#35201;&#20026;&#25152;&#26377;&#35831;&#27714;&#25552;&#20379;&#26576;&#31181;&#21151;&#33021;&#26102;&#65292;&#20363;&#22914;&#20570;&#26576;&#31181;&#26816;&#26597;&#65292;&#36825;&#23601;&#38750;&#24120;&#26377;&#29992;&#12290;</p><p>&#22788;&#29702;&#22120;&#26144;&#23556;&#20013;&#30340;&#25318;&#25130;&#22120;&#24517;&#39035;&#23454;&#29616;<tt class="literal">org.springframework.web.servlet</tt>&#21253;&#20013;&#30340;<tt class="literal">HandlerInterceptor</tt>&#25509;&#21475;&#12290;&#36825;&#20010;&#25509;&#21475;&#23450;&#20041;&#20102;&#19977;&#20010;&#26041;&#27861;&#65292;&#19968;&#20010;&#22312;&#22788;&#29702;&#22120;&#25191;&#34892;<span class="emphasis"><em>&#21069;</em></span>&#34987;&#35843;&#29992;&#65292;&#19968;&#20010;&#22312;&#22788;&#29702;&#22120;&#25191;&#34892;<span class="emphasis"><em>&#21518;</em></span>&#34987;&#35843;&#29992;&#65292;&#21478;&#19968;&#20010;&#22312;<span class="emphasis"><em>&#25972;&#20010;&#35831;&#27714;&#22788;&#29702;&#23436;&#21518;</em></span>&#35843;&#29992;&#12290;&#36825;&#19977;&#20010;&#26041;&#27861;&#25552;&#20379;&#20320;&#36275;&#22815;&#30340;&#28789;&#27963;&#24230;&#20570;&#20219;&#20309;&#22788;&#29702;&#21069;&#21644;&#22788;&#29702;&#21518;&#30340;&#25805;&#20316;&#12290;</p><p><tt class="literal">preHandle</tt>&#26041;&#27861;&#26377;&#19968;&#20010;boolean&#36820;&#22238;&#20540;&#12290;&#20351;&#29992;&#36825;&#20010;&#20540;&#65292;&#20320;&#21487;&#20197;&#35843;&#25972;&#25191;&#34892;&#38142;&#30340;&#34892;&#20026;&#12290;&#24403;&#36820;&#22238;<tt class="literal">true</tt>&#26102;&#65292;&#22788;&#29702;&#22120;&#25191;&#34892;&#38142;&#23558;&#32487;&#32493;&#25191;&#34892;&#65292;&#24403;&#36820;&#22238;<tt class="literal">false</tt>&#26102;&#65292;DispatcherServlet&#35748;&#20026;&#25318;&#25130;&#22120;&#26412;&#36523;&#23558;&#22788;&#29702;&#35831;&#27714;&#65288;&#27604;&#22914;&#26174;&#31034;&#27491;&#30830;&#30340;&#35270;&#22270;&#65289;&#65292;&#32780;&#19981;&#32487;&#32493;&#25191;&#34892;&#25191;&#34892;&#38142;&#20013;&#30340;&#20854;&#23427;&#25318;&#25130;&#22120;&#21644;&#22788;&#29702;&#22120;&#12290;</p><p>&#19979;&#38754;&#30340;&#20363;&#23376;&#25552;&#20379;&#20102;&#19968;&#20010;&#25318;&#25130;&#22120;&#65292;&#23427;&#25318;&#25130;&#25152;&#26377;&#35831;&#27714;&#65292;&#22914;&#26524;&#24403;&#21069;&#26102;&#38388;&#26159;&#22312;&#19978;&#21320;9&#28857;&#21040;&#19979;&#21320;6&#28857;&#65292;&#23558;&#37325;&#23450;&#21521;&#21040;&#26576;&#20010;&#39029;&#38754;&#12290;</p><pre class="programlisting">&lt;beans&gt;
    &lt;bean id="handlerMapping" 
          class="org.springframework.web.servlet.handler.SimpleUrlHandlerMapping"&gt;            
        &lt;property name="interceptors"&gt;
            &lt;list&gt;
                &lt;ref bean="officeHoursInterceptor"/&gt;
            &lt;/list&gt;
        &lt;/property&gt;
        &lt;property name="mappings"&gt;
            &lt;props&gt;
                &lt;prop key="/*.form"&gt;editAccountFormController&lt;/prop&gt;
                &lt;prop key="/*.view"&gt;editAccountFormController&lt;/prop&gt;
            &lt;/props&gt;
        &lt;/property&gt;
    &lt;/bean&gt;
    
    &lt;bean id="officeHoursInterceptor" 
          class="samples.TimeBasedAccessInterceptor"&gt;
        &lt;property name="openingTime"&gt;&lt;value&gt;9&lt;/value&gt;&lt;/property&gt;
        &lt;property name="closingTime"&gt;&lt;value&gt;18&lt;/value&gt;&lt;/property&gt;
    &lt;/bean&gt;    
&lt;beans&gt;</pre><p> </p><pre class="programlisting">package samples;

public class TimeBasedAccessInterceptor extends HandlerInterceptorAdapter {

    private int openingTime;    
    private int closingTime;    
    public void setOpeningTime(int openingTime) {
        this.openingTime = openingTime;
    }    
    public void setClosingTime(int closingTime) {
        this.closingTime = closingTime;
    }    
    public boolean preHandle(
            HttpServletRequest request,
            HttpServletResponse response,
            Object handler)
    throws Exception {
        Calendar cal = Calendar.getInstance();
        int hour = cal.get(HOUR_OF_DAY);
        if (openingTime &lt;= hour &lt; closingTime) {
            return true;
        } else {
            response.sendRedirect("http://host.com/outsideOfficeHours.html");
            return false;
        }
    }    
}</pre><p> &#20219;&#20309;&#25910;&#21040;&#30340;&#35831;&#27714;&#65292;&#37117;&#23558;&#34987;<tt class="literal">TimeBasedAccessInterceptor</tt>&#25130;&#33719;&#65292;&#22914;&#26524;&#24403;&#21069;&#26102;&#38388;&#19981;&#22312;&#19978;&#29677;&#26102;&#38388;&#65292;&#29992;&#25143;&#20250;&#34987;&#37325;&#23450;&#21521;&#21040;&#19968;&#20010;&#38745;&#24577;html&#39029;&#38754;&#65292;&#27604;&#22914;&#21578;&#35785;&#20182;&#21482;&#33021;&#22312;&#19978;&#29677;&#26102;&#38388;&#25165;&#33021;&#35775;&#38382;&#32593;&#31449;&#12290;</p><p>&#20320;&#21487;&#20197;&#21457;&#29616;&#65292;Spring&#25552;&#20379;&#20102;adapter&#65292;&#20351;&#20320;&#24456;&#23481;&#26131;&#22320;&#20351;&#29992;<tt class="literal">HandlerInterceptor</tt>&#12290;</p></div></div><div class="sect1" lang="zh_cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mvc-viewresolver"></a>12.5.&nbsp;&#35270;&#22270;&#19982;&#35270;&#22270;&#35299;&#26512;</h2></div></div><div></div></div><p>&#25152;&#26377;web&#24212;&#29992;&#30340;MVC&#26694;&#26550;&#37117;&#20250;&#26377;&#23427;&#20204;&#22788;&#29702;&#35270;&#22270;&#30340;&#26041;&#24335;&#12290;Spring&#25552;&#20379;&#20102;&#35270;&#22270;&#35299;&#26512;&#22120;&#65292;&#36825;&#20351;&#24471;&#20320;&#22312;&#27983;&#35272;&#22120;&#26174;&#31034;&#27169;&#22411;&#25968;&#25454;&#26102;&#19981;&#38656;&#35201;&#25351;&#23450;&#20855;&#20307;&#30340;&#35270;&#22270;&#25216;&#26415;&#12290;Spring&#20801;&#35768;&#20320;&#20351;&#29992;Java Server Page&#65292;Velocity&#27169;&#29256;&#21644;XSLT&#35270;&#22270;&#12290;<a href="view.html" title="&#31532;&nbsp;13&nbsp;&#31456;&nbsp;&#38598;&#25104;&#34920;&#29616;&#23618;">&#31532;&nbsp;13&nbsp;&#31456; <i>&#38598;&#25104;&#34920;&#29616;&#23618;</i></a>&#35814;&#32454;&#35828;&#26126;&#20102;&#22914;&#20309;&#38598;&#25104;&#19981;&#21516;&#30340;&#35270;&#22270;&#25216;&#26415;&#12290;</p><p>Spring&#22788;&#29702;&#35270;&#22270;&#30340;&#20004;&#20010;&#37325;&#35201;&#30340;&#31867;&#26159;<tt class="literal">ViewResolver</tt>&#21644;<tt class="literal">View</tt>&#12290;<tt class="literal">View</tt>&#25509;&#21475;&#20026;&#35831;&#27714;&#20316;&#20934;&#22791;&#65292;&#24182;&#23558;&#35831;&#27714;&#20256;&#36882;&#32473;&#26576;&#20010;&#35270;&#22270;&#25216;&#26415;&#12290;<tt class="literal">ViewResolver</tt>&#25552;&#20379;&#20102;&#19968;&#20010;&#35270;&#22270;&#21517;&#21644;&#23454;&#38469;&#35270;&#22270;&#20043;&#38388;&#30340;&#26144;&#23556;&#12290;</p><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-viewresolver-resolver"></a>12.5.1.&nbsp;ViewResolvers</h3></div></div><div></div></div><p>&#27491;&#22914;&#21069;&#38754;&#25152;&#35752;&#35770;&#30340;&#65292;SpringWeb&#26694;&#26550;&#30340;&#25152;&#26377;&#25511;&#21046;&#22120;&#37117;&#36820;&#22238;&#19968;&#20010;<tt class="literal">ModelAndView</tt>&#23454;&#20363;&#12290;Spring&#20013;&#30340;&#35270;&#22270;&#30001;&#35270;&#22270;&#21517;&#35782;&#21035;&#65292;&#35270;&#22270;&#35299;&#26512;&#22120;&#35299;&#26512;&#12290;Spring&#25552;&#20379;&#20102;&#35768;&#22810;&#35270;&#22270;&#35299;&#26512;&#22120;&#12290;&#25105;&#20204;&#23558;&#21015;&#20986;&#20854;&#20013;&#30340;&#19968;&#20123;&#65292;&#21644;&#23427;&#20204;&#30340;&#20363;&#23376;&#12290;</p><div class="table"><a name="d0e6832"></a><p class="title"><b>&#34920;&nbsp;12.5.&nbsp;&#35270;&#22270;&#35299;&#26512;&#22120;</b></p><table summary="&#35270;&#22270;&#35299;&#26512;&#22120;" border="1"><colgroup><col><col></colgroup><thead><tr><th>ViewResolver</th><th>&#25551;&#36848;</th></tr></thead><tbody><tr><td>AbstractCachingViewResolver</td><td>&#25277;&#35937;&#35270;&#22270;&#35299;&#26512;&#22120;&#65292;&#36127;&#36131;&#32531;&#23384;&#35270;&#22270;&#12290;&#35768;&#22810;&#35270;&#22270;&#38656;&#35201;&#22312;&#20351;&#29992;&#21069;&#20316;&#20934;&#22791;&#65292;&#20174;&#23427;&#32487;&#25215;&#30340;&#35270;&#22270;&#35299;&#26512;&#22120;&#21487;&#20197;&#32531;&#23384;&#35270;&#22270;&#12290;</td></tr><tr><td>ResourceBundleViewResolver</td><td>&#20351;&#29992;ResourceBundle&#20013;&#30340;bean&#23450;&#20041;&#23454;&#29616;ViewResolver&#65292;&#36825;&#20010;ResourceBundle&#30001;bundle&#30340;basename&#25351;&#23450;&#12290;&#36825;&#20010;bundle&#36890;&#24120;&#23450;&#20041;&#22312;&#19968;&#20010;&#20301;&#20110;classpath&#20013;&#30340;&#19968;&#20010;&#23646;&#24615;&#25991;&#20214;&#20013;</td></tr><tr><td>UrlBasedViewResolver</td><td>&#36825;&#20010;ViewResolver&#23454;&#29616;&#20801;&#35768;&#23558;&#31526;&#21495;&#35270;&#22270;&#21517;&#30452;&#25509;&#35299;&#26512;&#21040;URL&#19978;&#65292;&#32780;&#19981;&#38656;&#35201;&#26174;&#24335;&#30340;&#26144;&#23556;&#23450;&#20041;&#12290;&#22914;&#26524;&#20320;&#30340;&#35270;&#22270;&#21517;&#30452;&#25509;&#31526;&#21512;&#35270;&#22270;&#36164;&#28304;&#30340;&#21517;&#23383;&#32780;&#19981;&#38656;&#35201;&#20219;&#24847;&#30340;&#26144;&#23556;&#65292;&#23601;&#21487;&#20197;&#20351;&#29992;&#36825;&#20010;&#35299;&#26512;&#22120;</td></tr><tr><td>InternalResourceViewResolver</td><td>UrlBasedViewResolver&#30340;&#23376;&#31867;&#65292;&#23427;&#24456;&#26041;&#20415;&#22320;&#25903;&#25345;InternalResourceView&#65288;&#20063;&#23601;&#26159;Servlet&#21644;JSP&#65289;&#65292;&#20197;&#21450;JstlView&#21644;TilesView&#30340;&#23376;&#31867;&#12290;&#30001;&#36825;&#20010;&#35299;&#26512;&#22120;&#29983;&#25104;&#30340;&#35270;&#22270;&#30340;&#31867;&#37117;&#21487;&#20197;&#36890;&#36807;setViewClass&#25351;&#23450;&#12290;&#35814;&#32454;&#21442;&#32771;UrlBasedViewResolver&#30340;javadocs</td></tr><tr><td>VelocityViewResolver</td><td>UrlBasedViewResolver&#30340;&#23376;&#31867;&#65292;&#23427;&#33021;&#26041;&#20415;&#22320;&#25903;&#25345;VelocityView&#65288;&#20063;&#23601;&#26159;Velocity&#27169;&#29256;&#65289;&#20197;&#21450;&#23427;&#30340;&#23376;&#31867;</td></tr></tbody></table></div><p>&#20363;&#22914;&#65292;&#24403;&#20351;&#29992;JSP&#26102;&#65292;&#21487;&#20197;&#20351;&#29992;<tt class="literal">UrlBasedViewResolver</tt>&#12290;&#36825;&#20010;&#35270;&#22270;&#35299;&#26512;&#22120;&#23558;&#35270;&#22270;&#21517;&#32763;&#35793;&#25104;URL&#65292;&#24182;&#23558;&#35831;&#27714;&#20256;&#36882;&#32473;RequestDispatcher&#26174;&#31034;&#35270;&#22270;&#12290;</p><pre class="programlisting">&lt;bean id="viewResolver" 
      class="org.springframework.web.servlet.view.UrlBasedViewResolver"&gt;
    &lt;property name="prefix"&gt;&lt;value&gt;/WEB-INF/jsp/&lt;/value&gt;&lt;/property&gt;
    &lt;property name="suffix"&gt;&lt;value&gt;.jsp&lt;/value&gt;&lt;/property&gt;
&lt;/bean&gt;</pre><p> &#24403;&#36820;&#22238;<tt class="literal">test</tt>&#20316;&#20026;&#35270;&#22270;&#21517;&#26102;&#65292;&#36825;&#20010;&#35270;&#22270;&#35299;&#26512;&#22120;&#23558;&#35831;&#27714;&#20256;&#36882;&#32473;RequestDispatcher&#65292;RequestDispatcher&#23558;&#35831;&#27714;&#20877;&#20256;&#36882;&#32473;<tt class="literal">/WEB-INF/jsp/test.jsp</tt>&#12290;</p><p>&#24403;&#22312;&#19968;&#20010;web&#24212;&#29992;&#20013;&#28151;&#21512;&#20351;&#29992;&#19981;&#21516;&#30340;&#35270;&#22270;&#25216;&#26415;&#26102;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;ResourceBundleViewResolver&#65306;</p><pre class="programlisting">&lt;bean id="viewResolver"
      class="org.springframework.web.servlet.view.ResourceBundleViewResolver"&gt;
    &lt;property name="baseName"&gt;&lt;value&gt;views&lt;/value&gt;&lt;/property&gt;
    &lt;property name="defaultParentView"&gt;&lt;value&gt;parentView&lt;/value&gt;&lt;/property
&lt;/bean&gt;</pre></div></div><div class="sect1" lang="zh_cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mvc-localeresolver"></a>12.6.&nbsp;&#20351;&#29992;&#26412;&#22320;&#21270;&#20449;&#24687;</h2></div></div><div></div></div><p>Spring&#26550;&#26500;&#30340;&#32477;&#22823;&#37096;&#20998;&#37117;&#25903;&#25345;&#22269;&#38469;&#21270;&#65292;&#23601;&#35937;Spring&#30340;web&#26694;&#26550;&#19968;&#26679;&#12290;SpringWeb&#26694;&#26550;&#20801;&#35768;&#20320;&#20351;&#29992;&#23458;&#25143;&#31471;&#26412;&#22320;&#21270;&#20449;&#24687;&#33258;&#21160;&#35299;&#26512;&#28040;&#24687;&#12290;&#36825;&#30001;<tt class="literal">LocaleResolver</tt>&#23545;&#35937;&#23436;&#25104;&#12290;</p><p>&#24403;&#25910;&#21040;&#35831;&#27714;&#26102;&#65292;DispatcherServlet&#23547;&#25214;&#19968;&#20010;&#26412;&#22320;&#21270;&#20449;&#24687;&#35299;&#26512;&#22120;&#65292;&#22914;&#26524;&#25214;&#21040;&#23427;&#23601;&#20351;&#29992;&#23427;&#35774;&#32622;&#26412;&#22320;&#21270;&#20449;&#24687;&#12290;&#20351;&#29992;<tt class="literal">RequestContext.getLocale()</tt>&#26041;&#27861;&#65292;&#20320;&#24635;&#21487;&#20197;&#33719;&#21462;&#26412;&#22320;&#21270;&#20449;&#24687;&#20379;&#26412;&#22320;&#21270;&#20449;&#24687;&#35299;&#26512;&#22120;&#20351;&#29992;&#12290;</p><p>&#38500;&#20102;&#33258;&#21160;&#26412;&#22320;&#21270;&#20449;&#24687;&#35299;&#26512;&#65292;&#20320;&#36824;&#21487;&#20197;&#23558;&#19968;&#20010;&#25318;&#25130;&#22120;&#25918;&#32622;&#21040;&#22788;&#29702;&#22120;&#26144;&#23556;&#19978;&#65288;&#21442;&#32771;<a href="mvc.html#mvc-handlermapping-interceptor" title="12.4.3.&nbsp;&#28155;&#21152;HandlerInterceptors">&#31532;&nbsp;12.4.3&nbsp;&#33410; &#8220;&#28155;&#21152;HandlerInterceptors&#8221;</a>&#65289;&#65292;&#20197;&#20415;&#22312;&#26576;&#31181;&#29615;&#22659;&#19979;&#65292;&#27604;&#22914;&#22522;&#20110;&#35831;&#27714;&#20013;&#30340;&#21442;&#25968;&#65292;&#25913;&#21464;&#26412;&#22320;&#21270;&#20449;&#24687;&#12290;</p><p>&#26412;&#22320;&#21270;&#20449;&#24687;&#35299;&#26512;&#22120;&#21644;&#25318;&#25130;&#22120;&#37117;&#23450;&#20041;&#22312;<tt class="literal">org.springframework.web.servlet.i18n</tt>&#21253;&#20013;&#65292;&#24182;&#19988;&#22312;&#20320;&#30340;&#24212;&#29992;&#19978;&#19979;&#25991;&#20013;&#37197;&#32622;&#12290;&#20320;&#21487;&#20197;&#36873;&#25321;&#20351;&#29992;Spring&#20013;&#30340;&#26412;&#22320;&#21270;&#20449;&#24687;&#35299;&#26512;&#22120;&#12290;</p><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-localeresolver-acceptheader"></a>12.6.1.&nbsp;<tt class="literal">AcceptHeaderLocaleResolver</tt></h3></div></div><div></div></div><p>&#36825;&#20010;&#26412;&#22320;&#21270;&#20449;&#24687;&#35299;&#26512;&#22120;&#26816;&#26597;&#35831;&#27714;&#20013;&#23458;&#25143;&#31471;&#27983;&#35272;&#22120;&#21457;&#36865;&#30340;<tt class="literal">accept-language</tt>&#22836;&#12290;&#36890;&#24120;&#36825;&#20010;&#22836;&#20449;&#24687;&#21253;&#21547;&#23458;&#25143;&#31471;&#25805;&#20316;&#31995;&#32479;&#30340;&#26412;&#22320;&#21270;&#20449;&#24687;&#12290;</p></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-localeresolver-cookie"></a>12.6.2.&nbsp;<tt class="literal">CookieLocaleResolver</tt></h3></div></div><div></div></div><p>&#36825;&#20010;&#26412;&#22320;&#21270;&#20449;&#24687;&#35299;&#26512;&#22120;&#26816;&#26597;&#23458;&#25143;&#31471;&#20013;&#30340;cookie&#26159;&#21542;&#26412;&#22320;&#21270;&#20449;&#24687;&#34987;&#25351;&#23450;&#20102;&#12290;&#22914;&#26524;&#25351;&#23450;&#23601;&#20351;&#29992;&#35813;&#26412;&#22320;&#21270;&#20449;&#24687;&#12290;&#20351;&#29992;&#36825;&#20010;&#26412;&#22320;&#21270;&#20449;&#24687;&#35299;&#26512;&#22120;&#30340;&#23646;&#24615;&#65292;&#20320;&#21487;&#20197;&#25351;&#23450;cookie&#21517;&#65292;&#20197;&#21450;&#26368;&#22823;&#29983;&#23384;&#26399;&#12290;
      </p><pre class="programlisting">&lt;bean id="localeResolver"&gt;
    &lt;property name="cookieName"&gt;&lt;value&gt;clientlanguage&lt;/value&gt;&lt;/property&gt;
    &lt;!-- in seconds. If set to -1, the cookie is not persisted (deleted when browser shuts down) --&gt;
    &lt;property name="cookieMaxAge"&gt;&lt;value&gt;100000&lt;/value&gt;&lt;/property&gt;
&lt;/bean&gt;</pre><p> &#36825;&#20010;&#20363;&#23376;&#23450;&#20041;&#20102;&#19968;&#20010;CookieLocaleResolver&#12290;</p><div class="table"><a name="d0e6928"></a><p class="title"><b>&#34920;&nbsp;12.6.&nbsp;WebApplicationContext&#20013;&#30340;&#29305;&#27530;bean</b></p><table summary="WebApplicationContext&#20013;&#30340;&#29305;&#27530;bean" border="1"><colgroup><col><col><col></colgroup><thead><tr><th>&#23646;&#24615;</th><th>&#32570;&#30465;&#20540;</th><th>&#25551;&#36848;</th></tr></thead><tbody><tr><td>cookieName</td><td>classname + LOCALE</td><td>cookie&#21517;</td></tr><tr><td>cookieMaxAge</td><td>Integer.MAX_INT</td><td>cookie&#22312;&#23458;&#25143;&#31471;&#23384;&#22312;&#30340;&#26368;&#22823;&#26102;&#38388;&#12290;&#22914;&#26524;&#35813;&#20540;&#26159;-1&#65292;&#36825;&#20010;cookie&#19968;&#30452;&#23384;&#22312;&#65292;&#30452;&#21040;&#23458;&#25143;&#20851;&#38381;&#23427;&#30340;&#27983;&#35272;&#22120;</td></tr><tr><td>cookiePath</td><td>/</td><td>&#20351;&#29992;&#36825;&#20010;&#21442;&#25968;&#65292;&#20320;&#21487;&#20197;&#38480;&#21046;cookie&#21482;&#26377;&#20320;&#30340;&#19968;&#37096;&#20998;&#32593;&#31449;&#39029;&#38754;&#21487;&#20197;&#35775;&#38382;&#12290;&#24403;cookiePath&#34987;&#25351;&#23450;&#65292;cookie&#21482;&#33021;&#34987;&#35813;&#30446;&#24405;&#20197;&#21450;&#23376;&#30446;&#24405;&#30340;&#39029;&#38754;&#35775;&#38382;</td></tr></tbody></table></div></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-localeresolver-session"></a>12.6.3.&nbsp;<tt class="literal">SessionLocaleResolver</tt></h3></div></div><div></div></div><p><tt class="literal">SessionLocaleResolver</tt>&#20801;&#35768;&#20320;&#20174;&#29992;&#25143;&#35831;&#27714;&#30456;&#20851;&#30340;&#20250;&#35805;&#20013;&#33719;&#21462;&#26412;&#22320;&#21270;&#20449;&#24687;&#12290;</p></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-localeresolver-interceptor"></a>12.6.4.&nbsp;<tt class="literal">LocaleChangeInterceptor</tt></h3></div></div><div></div></div><p>&#20320;&#21487;&#20197;&#20351;&#29992;<tt class="literal">LocaleChangeInterceptor</tt>&#20462;&#25913;&#26412;&#22320;&#21270;&#20449;&#24687;&#12290;&#36825;&#20010;&#25318;&#25130;&#22120;&#38656;&#35201;&#28155;&#21152;&#21040;&#22788;&#29702;&#22120;&#26144;&#23556;&#20013;&#65288;&#21442;&#32771;<a href="mvc.html#mvc-handlermapping" title="12.4.&nbsp;&#22788;&#29702;&#22120;&#26144;&#23556;">&#31532;&nbsp;12.4&nbsp;&#33410; &#8220;&#22788;&#29702;&#22120;&#26144;&#23556;&#8221;</a>&#65289;&#65292;&#24182;&#19988;&#23427;&#20250;&#22312;&#35831;&#27714;&#20013;&#26816;&#26597;&#21442;&#25968;&#20462;&#25913;&#26412;&#22320;&#21270;&#20449;&#24687;&#65288;&#23427;&#22312;&#19978;&#19979;&#25991;&#20013;&#30340;LocaleResolver&#20013;&#35843;&#29992;<tt class="literal">setLocale()</tt>&#65289;&#12290;</p><pre class="programlisting">&lt;bean id="localeChangeInterceptor" 
      class="org.springframework.web.servlet.i18n.LocaleChangeInterceptor"&gt;
    &lt;property name="paramName"&gt;&lt;value&gt;siteLanguage&lt;/value&gt;&lt;/property&gt;
&lt;/bean&gt;
        
&lt;bean id="localeResolver"
      class="org.springframework.web.servlet.i18n.CookieLocaleResolver"/&gt;
         
&lt;bean id="urlMapping" 
      class="org.springframework.web.servlet.handler.SimpleUrlHandlerMapping"&gt; 
    &lt;property name="interceptors"&gt;
        &lt;list&gt;
            &lt;ref local="localeChangeInterceptor"/&gt;
        &lt;/list&gt;
    &lt;/property&gt;
    &lt;property name="mappings"&gt;
        &lt;props&gt;
            &lt;prop key="/**/*.view"&gt;someController&lt;/prop&gt;
        &lt;/props&gt;
    &lt;/property&gt;
&lt;/bean&gt;</pre><p> &#25152;&#26377;&#21253;&#21547;&#21442;&#25968;<tt class="literal">siteLanguage</tt>&#30340;*.view&#36164;&#28304;&#30340;&#35831;&#27714;&#37117;&#20250;&#25913;&#21464;&#26412;&#22320;&#21270;&#20449;&#24687;&#12290;&#25152;&#20197;<tt class="literal">http://www.sf.net/home.view?siteLanguage=nl</tt>&#30340;&#35831;&#27714;&#20250;&#23558;&#32593;&#31449;&#35821;&#35328;&#20462;&#25913;&#20026;&#33655;&#20848;&#35821;&#12290;</p></div></div><div class="sect1" lang="zh_cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mvc-themeresolver"></a>12.7.&nbsp;&#20027;&#39064;&#20351;&#29992;</h2></div></div><div></div></div><p>&#31354;&#27573;&#33853;</p></div><div class="sect1" lang="zh_cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mvc-multipart"></a>12.8.&nbsp;Spring&#23545;multipart&#65288;&#25991;&#20214;&#19978;&#20256;&#65289;&#30340;&#25903;&#25345;</h2></div></div><div></div></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-multipart-introduction"></a>12.8.1.&nbsp;&#20171;&#32461;</h3></div></div><div></div></div><p>Spring&#30001;&#20869;&#32622;&#30340;multipart&#25903;&#25345;web&#24212;&#29992;&#20013;&#30340;&#25991;&#20214;&#19978;&#20256;&#12290;multipart&#25903;&#25345;&#30340;&#35774;&#35745;&#26159;&#36890;&#36807;&#23450;&#20041;<tt class="literal">org.springframework.web.multipart</tt>&#21253;&#20013;&#30340;&#25554;&#20214;&#23545;&#35937;<tt class="literal">MultipartResovler</tt>&#26469;&#23436;&#25104;&#30340;&#12290;Spring&#25552;&#20379;MultipartResolver&#21487;&#20197;&#25903;&#25345;<span class="emphasis"><em>Commons FileUpload</em></span> (<a href="http://jakarta.apache.org/commons/fileupload" target="_top">http://jakarta.apache.org/commons/fileupload</a>)&#21644;<span class="emphasis"><em>COS FileUpload</em></span> (<a href="http://www.servlets.com/cos" target="_top">http://www.servlets.com/cos</a>)&#12290;&#26412;&#31456;&#21518;&#38754;&#30340;&#37096;&#20998;&#25551;&#36848;&#20102;&#25991;&#20214;&#19978;&#20256;&#26159;&#22914;&#20309;&#25903;&#25345;&#30340;&#12290;</p><p>&#32570;&#30465;&#65292;Spring&#26159;&#27809;&#26377;multipart&#22788;&#29702;&#65292;&#22240;&#20026;&#19968;&#20123;&#24320;&#21457;&#32773;&#24819;&#35201;&#33258;&#24049;&#22788;&#29702;&#23427;&#20204;&#12290;&#22914;&#26524;&#20320;&#24819;&#20351;&#29992;Spring&#30340;multipart&#65292;&#38656;&#35201;&#22312;web&#24212;&#29992;&#30340;&#19978;&#19979;&#25991;&#20013;&#28155;&#21152;multipart&#35299;&#26512;&#22120;&#12290;&#36825;&#26679;&#65292;&#27599;&#20010;&#35831;&#27714;&#23601;&#20250;&#34987;&#26816;&#26597;&#26159;&#21542;&#21253;&#21547;multipart&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#35831;&#27714;&#20013;&#21253;&#21547;multipart&#65292;&#20320;&#30340;&#19978;&#19979;&#25991;&#20013;&#23450;&#20041;&#30340;MultipartResolver&#23601;&#20250;&#35299;&#26512;&#23427;&#12290;&#36825;&#26679;&#65292;&#20320;&#35831;&#27714;&#20013;&#30340;multipart&#23646;&#24615;&#23601;&#20250;&#35937;&#20854;&#23427;&#23646;&#24615;&#19968;&#26679;&#34987;&#22788;&#29702;&#12290;</p></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-multipart-resolver"></a>12.8.2.&nbsp;&#20351;&#29992;<tt class="literal">MultipartResolver</tt></h3></div></div><div></div></div><p>&#19979;&#38754;&#30340;&#20363;&#23376;&#35828;&#26126;&#20102;&#22914;&#20309;&#20351;&#29992;<tt class="literal">CommonsMultipartResolver</tt>&#65306;</p><pre class="programlisting">&lt;bean id="multipartResolver" 
    class="org.springframework.web.multipart.commons.CommonsMultipartResolver"&gt;

    &lt;!-- one of the properties available; the maximum file size in bytes --&gt;
    &lt;property name="maximumFileSize"&gt;
        &lt;value&gt;100000&lt;/value&gt;
    &lt;/property&gt;
&lt;/bean&gt;</pre><p>&#36825;&#20010;&#20363;&#23376;&#20351;&#29992;<tt class="literal">CosMultipartResolver</tt>&#65306;</p><pre class="programlisting">&lt;bean id="multipartResolver" 
    class="org.springframework.web.multipart.cos.CosMultipartResolver"&gt;

    &lt;!-- one of the properties available; the maximum file size in bytes --&gt;
    &lt;property name="maximumFileSize"&gt;
        &lt;value&gt;100000&lt;/value&gt;
    &lt;/property&gt;
&lt;/bean&gt;</pre><p>&#24403;&#28982;&#20320;&#38656;&#35201;&#22312;&#20320;&#30340;classpath&#20013;&#20026;multipart&#35299;&#26512;&#22120;&#25552;&#20379;&#27491;&#30830;&#30340;jar&#25991;&#20214;&#12290;&#22914;&#26524;&#26159;CommonsMultipartResolver&#65292;&#20320;&#38656;&#35201;&#20351;&#29992;<tt class="literal">commons-fileupload.jar</tt>&#65292;&#22914;&#26524;&#26159;CosMultipartResolver&#65292;&#20351;&#29992;<tt class="literal">cos.jar</tt>&#12290;</p><p>&#20320;&#24050;&#32463;&#30475;&#21040;&#22914;&#20309;&#35774;&#32622;Spring&#22788;&#29702;multipart&#35831;&#27714;&#65292;&#25509;&#19979;&#26469;&#25105;&#20204;&#30475;&#30475;&#22914;&#20309;&#20351;&#29992;&#23427;&#12290;&#24403;Spring&#30340;DispatchServlet&#21457;&#29616;multipart&#35831;&#27714;&#26102;&#65292;&#23427;&#20250;&#28608;&#27963;&#23450;&#20041;&#22312;&#19978;&#19979;&#25991;&#20013;&#30340;&#35299;&#26512;&#22120;&#24182;&#22788;&#29702;&#35831;&#27714;&#12290;&#23427;&#36890;&#24120;&#20570;&#30340;&#23601;&#26159;&#23558;&#24403;&#21069;&#30340;<tt class="literal">HttpServletRequest</tt>&#23553;&#35013;&#21040;&#25903;&#25345;multipart&#30340;<tt class="literal">MultipartHttpServletRequest</tt>&#12290;&#20351;&#29992;MultipartHttpServletRequest&#65292;&#20320;&#21487;&#20197;&#33719;&#21462;&#35831;&#27714;&#25152;&#21253;&#21547;&#30340;multipart&#20449;&#24687;&#65292;&#22312;&#25511;&#21046;&#22120;&#20013;&#33719;&#21462;&#20855;&#20307;&#30340;multipart&#20869;&#23481;&#12290;</p></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-multipart-forms"></a>12.8.3.&nbsp;&#22312;&#19968;&#20010;&#34920;&#21333;&#20013;&#22788;&#29702;multipart</h3></div></div><div></div></div><p>&#22312;MultipartResolver&#23436;&#25104;multipart&#35299;&#26512;&#21518;&#65292;multipart&#35831;&#27714;&#23601;&#20250;&#21644;&#20854;&#23427;&#35831;&#27714;&#19968;&#26679;&#34987;&#22788;&#29702;&#12290;&#20351;&#29992;multipart&#65292;&#20320;&#38656;&#35201;&#21019;&#24314;&#19968;&#20010;&#24102;&#25991;&#20214;&#19978;&#20256;&#22495;&#30340;&#34920;&#21333;&#65292;&#35753;Spring&#23558;&#25991;&#20214;&#32465;&#23450;&#21040;&#20320;&#30340;&#34920;&#21333;&#19978;&#12290;&#23601;&#35937;&#20854;&#23427;&#19981;&#20250;&#33258;&#21160;&#36716;&#25442;&#25104;String&#25110;&#22522;&#26412;&#31867;&#22411;&#30340;&#23646;&#24615;&#19968;&#26679;&#65292;&#20026;&#20102;&#23558;&#20108;&#36827;&#21046;&#25968;&#25454;&#25918;&#21040;&#20320;&#30340;bean&#20013;&#65292;&#20320;&#24517;&#39035;&#29992;<tt class="literal">ServletRequestDatabinder</tt>&#27880;&#20876;&#19968;&#20010;&#33258;&#23450;&#20041;&#30340;&#32534;&#36753;&#22120;&#12290;Spring&#26377;&#35768;&#22810;&#32534;&#36753;&#22120;&#21487;&#20197;&#29992;&#26469;&#22788;&#29702;&#25991;&#20214;&#65292;&#20197;&#21450;&#22312;bean&#20013;&#35774;&#32622;&#32467;&#26524;&#12290;<tt class="literal">StringMultipartEditor</tt>&#33021;&#23558;&#25991;&#20214;&#36716;&#25442;&#25104;String&#65288;&#20351;&#29992;&#29992;&#25143;&#23450;&#20041;&#30340;&#23383;&#31526;&#38598;&#65289;&#65292;<tt class="literal">ByteArrayMultipartEditor</tt>&#33021;&#23558;&#25991;&#20214;&#36716;&#25442;&#25104;&#23383;&#33410;&#25968;&#32452;&#12290;&#23427;&#20204;&#23601;&#35937;<tt class="literal">CustomDateEditor</tt>&#19968;&#26679;&#24037;&#20316;&#12290;</p><p>&#25152;&#20197;&#65292;&#20026;&#20102;&#22312;&#32593;&#31449;&#20013;&#20351;&#29992;&#34920;&#21333;&#19978;&#20256;&#25991;&#20214;&#65292;&#38656;&#35201;&#22768;&#26126;&#35299;&#26512;&#22120;&#65292;&#23558;URL&#26144;&#23556;&#21040;&#25511;&#21046;&#22120;&#65292;&#20197;&#21450;&#22788;&#29702;bean&#30340;&#25511;&#21046;&#22120;&#26412;&#36523;&#12290;</p><pre class="programlisting">&lt;beans&gt;

    ...

    &lt;bean id="multipartResolver"
        class="org.springframework.web.multipart.commons.CommonsMultipartResolver"/&gt;

    &lt;bean id="urlMapping" class="org.springframework.web.servlet.handler.SimpleUrlHandlerMapping"&gt;
        &lt;property name="mappings"&gt;
            &lt;props&gt;
                &lt;prop key="/upload.form"&gt;fileUploadController&lt;/prop&gt;
            &lt;/props&gt;
        &lt;/property&gt;
    &lt;/bean&gt;

    &lt;bean id="fileUploadController" class="examples.FileUploadController"&gt;
        &lt;property name="commandClass"&gt;&lt;value&gt;examples.FileUploadBean&lt;/value&gt;&lt;/property&gt;
        &lt;property name="formView"&gt;&lt;value&gt;fileuploadform&lt;/value&gt;&lt;/property&gt;
        &lt;property name="successView"&gt;&lt;value&gt;confirmation&lt;/value&gt;&lt;/property&gt;
    &lt;/bean&gt;

&lt;/beans&gt;</pre><p>&#28982;&#21518;&#65292;&#21019;&#24314;&#25511;&#21046;&#22120;&#21644;&#21547;&#26377;&#25991;&#20214;&#23646;&#24615;&#30340;bean</p><pre class="programlisting">// snippet from FileUploadController
public class FileUploadController extends SimpleFormController {

    protected ModelAndView onSubmit(
        HttpServletRequest request,
        HttpServletResponse response,
        Object command,
        BindException errors)
        throws ServletException, IOException {
        
        // cast the bean
        FileUploadBean bean = (FileUploadBean)command;
        
        // let's see if there's content there
        byte[] file = bean.getFile();
        if (file == null) {
            // hmm, that's strange, the user did not upload anything
        }

        // well, let's do nothing with the bean for now and return:        
        return super.onSubmit(request, response, command, errors);
    }
    
    protected void initBinder(
        HttpServletRequest request,
        ServletRequestDataBinder binder)
        throws ServletException {
        // to actually be able to convert Multipart instance to byte[]
        // we have to register a custom editor (in this case the
        // ByteArrayMultipartEditor
        binder.registerCustomEditor(byte[].class, new ByteArrayMultipartFileEditor());
        // now Spring knows how to handle multipart object and convert them
    }
        
}

// snippet from FileUploadBean
public class FileUploadBean {
    private byte[] file;
    
    public void setFile(byte[] file) {
        this.file = file;
    }
    
    public byte[] getFile() {
        return file;
    }
}</pre><p>&#20320;&#20250;&#30475;&#21040;&#65292;FileUploadBean&#26377;&#19968;&#20010;byte[]&#31867;&#22411;&#30340;&#23646;&#24615;&#26469;&#23384;&#25918;&#25991;&#20214;&#12290;&#25511;&#21046;&#22120;&#27880;&#20876;&#19968;&#20010;&#33258;&#23450;&#20041;&#30340;&#32534;&#36753;&#22120;&#20197;&#20415;&#35753;Spring&#30693;&#36947;&#22914;&#20309;&#23558;&#35299;&#26512;&#22120;&#21457;&#29616;&#30340;multipart&#23545;&#35937;&#36716;&#25442;&#25104;bean&#25351;&#23450;&#30340;&#23646;&#24615;&#12290;&#22312;&#36825;&#20123;&#20363;&#23376;&#20013;&#65292;&#27809;&#26377;&#23545;bean&#30340;byte[]&#31867;&#22411;&#30340;&#23646;&#24615;&#20570;&#20219;&#20309;&#22788;&#29702;&#65292;&#20294;&#26159;&#22312;&#23454;&#38469;&#20013;&#21487;&#20197;&#20570;&#20219;&#20309;&#20320;&#24819;&#20570;&#30340;&#65288;&#23558;&#25991;&#20214;&#23384;&#20648;&#22312;&#25968;&#25454;&#24211;&#20013;&#65292;&#36890;&#36807;&#30005;&#23376;&#37038;&#20214;&#21457;&#36865;&#32473;&#26576;&#20154;&#65292;&#31561;&#31561;&#65289;&#12290;</p><p>&#20294;&#26159;&#25105;&#20204;&#36824;&#27809;&#26377;&#32467;&#26463;&#12290;&#20026;&#20102;&#35753;&#29992;&#25143;&#33021;&#30495;&#27491;&#19978;&#20256;&#20123;&#19996;&#35199;&#65292;&#25105;&#20204;&#24517;&#39035;&#21019;&#24314;&#34920;&#21333;&#65306;</p><pre class="programlisting">&lt;html&gt;
    &lt;head&gt;
        &lt;title&gt;Upload a file please&lt;/title&gt;
    &lt;/head&gt;
    &lt;body&gt;
        &lt;h1&gt;Please upload a file&lt;/h1&gt;
        &lt;form method="post" action="upload.form" enctype="multipart/form-data"&gt;
            &lt;input type="file" name="file"/&gt;
            &lt;input type="submit"/&gt;
        &lt;/form&gt;
    &lt;/body&gt;
&lt;/html&gt;</pre><p> &#20320;&#21487;&#20197;&#30475;&#21040;&#65292;&#25105;&#20204;&#22312;bean&#30340;byte[]&#31867;&#22411;&#30340;&#23646;&#24615;&#21518;&#38754;&#21019;&#24314;&#20102;&#19968;&#20010;&#22495;&#12290;&#25105;&#20204;&#36824;&#28155;&#21152;&#20102;&#32534;&#30721;&#23646;&#24615;&#20197;&#20415;&#35753;&#27983;&#35272;&#22120;&#30693;&#36947;&#22914;&#20309;&#32534;&#30721;multipart&#30340;&#22495;&#65288;&#21315;&#19975;&#19981;&#35201;&#24536;&#35760;&#65281;&#65289;&#29616;&#22312;&#23601;&#21487;&#20197;&#24037;&#20316;&#20102;&#12290;</p></div></div><div class="sect1" lang="zh_cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mvc-exceptionhandlers"></a>12.9.&nbsp;&#22788;&#29702;&#24322;&#24120;</h2></div></div><div></div></div><p>Spring&#25552;&#20379;&#20102;<tt class="literal">HandlerExceptionResolvers</tt>&#26469;&#24110;&#21161;&#22788;&#29702;&#25511;&#21046;&#22120;&#22788;&#29702;&#20320;&#30340;&#35831;&#27714;&#26102;&#25152;&#21457;&#29983;&#30340;&#24322;&#24120;&#12290;<tt class="literal">HandlerExceptionResolvers</tt>&#22312;&#26576;&#31181;&#31243;&#24230;&#19978;&#21644;&#20320;&#22312;web&#24212;&#29992;&#30340;<tt class="literal">web.xml</tt>&#20013;&#23450;&#20041;&#30340;&#24322;&#24120;&#26144;&#23556;&#24456;&#30456;&#35937;&#12290;&#28982;&#32780;&#65292;&#23427;&#20204;&#25552;&#20379;&#20102;&#19968;&#31181;&#26356;&#28789;&#27963;&#30340;&#22788;&#29702;&#24322;&#24120;&#30340;&#26041;&#24335;&#12290;&#39318;&#20808;&#65292;HandlerExceptionResolver&#36890;&#30693;&#20320;&#24403;&#24322;&#24120;&#25243;&#20986;&#26102;&#22914;&#20309;&#22788;&#29702;&#12290;&#24182;&#19988;&#65292;&#36825;&#31181;&#21487;&#32534;&#31243;&#30340;&#24322;&#24120;&#22788;&#29702;&#26041;&#24335;&#20351;&#24471;&#22312;&#35831;&#27714;&#34987;&#20256;&#36882;&#21040;&#21478;&#19968;&#20010;URL&#21069;&#32473;&#20102;&#20320;&#26356;&#22810;&#30340;&#21709;&#24212;&#36873;&#25321;&#12290;&#65288;&#36825;&#23601;&#21644;&#20351;&#29992;servlet&#29305;&#23450;&#24322;&#24120;&#26144;&#23556;&#30340;&#24773;&#20917;&#19968;&#26679;&#65289;&#12290;</p><p>&#23454;&#29616;<tt class="literal">HandlerExceptionResolver</tt>&#38656;&#35201;&#23454;&#29616;<tt class="literal">resolveException(Exception, Handler)</tt>&#26041;&#27861;&#24182;&#36820;&#22238;<tt class="literal">ModelAndView</tt>&#65292;&#38500;&#20102;<tt class="literal">HandlerExceptionResolver</tt>&#65292;&#20320;&#36824;&#21487;&#20197;&#20351;&#29992;<tt class="literal">SimpleMappingExceptionResolver</tt>&#12290;&#36825;&#20010;&#35299;&#26512;&#22120;&#20351;&#20320;&#33021;&#22815;&#33719;&#21462;&#20219;&#20309;&#25243;&#20986;&#30340;&#24322;&#24120;&#30340;&#31867;&#21517;&#65292;&#24182;&#23558;&#23427;&#26144;&#23556;&#21040;&#35270;&#22270;&#21517;&#12290;&#36825;&#21644;servlet API&#30340;&#24322;&#24120;&#26144;&#23556;&#22312;&#21151;&#33021;&#19978;&#26159;&#31561;&#20215;&#30340;&#65292;&#20294;&#26159;&#23427;&#36824;&#20026;&#19981;&#21516;&#30340;&#22788;&#29702;&#22120;&#25243;&#20986;&#30340;&#24322;&#24120;&#20570;&#26356;&#32454;&#31890;&#24230;&#30340;&#26144;&#23556;&#25552;&#20379;&#21487;&#33021;&#12290;</p></div><div class="sect1" lang="zh_cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mvc-utilities"></a>12.10.&nbsp;&#20849;&#21516;&#29992;&#21040;&#30340;&#24037;&#20855;</h2></div></div><div></div></div><div class="sect2" lang="zh_cn"><div class="titlepage"><div><div><h3 class="title"><a name="mvc-utilities-pathmatching"></a>12.10.1.&nbsp;&#20851;&#20110;pathmatcher&#30340;&#23567;&#25925;&#20107;</h3></div></div><div></div></div><p>ToDo</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="orm.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="view.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;&nbsp;11&nbsp;&#31456;&nbsp;&#20351;&#29992;ORM&#24037;&#20855;&#36827;&#34892;&#25968;&#25454;&#35775;&#38382; &nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;&nbsp;13&nbsp;&#31456;&nbsp;&#38598;&#25104;&#34920;&#29616;&#23618;</td></tr></table></div></body></html>